[{"title":"毛概","date":"2017-06-29T12:55:03.000Z","path":"2017/06/29/毛概/","text":"马克思主义中国化两大理论成果 如何理解马克思主义中国化的科学内涵和重要意义科学内涵马克思主义中国化，就是将马克思主义基本原理同中国具体实际相结合，不断形成具有中国特色的马克思主义理论成果的过程。（具体的说，就是把马克思主义基本原理同中国革命、建设和改革的实践结合起来，同中国的优秀历史传统和优秀文化结合起来，既坚持马克思主义又发展马克思主义）。 紧密联系中国实际，运用马克思主义解决中国革命、建设和改革中的问题 总结中国革命、建设和改革的实践经验和历史经验，坚持和发展马克思主义 把马克思主义植根于中国的优秀文化之中，赋予马克思主义以鲜明的中国特色 总之，马克思主义中国化就是在运用马克思主义解决中国实际问题的过程中，不断赋予马克思主义以鲜明的中国特色 重要意义 马克思主义中国化的理论成果指引着党和人民的伟大事业不断取得胜利。 马克思主义中国化的理论成果提供了凝聚全党和全国各族人民的强大精神支柱。 马克思主义中国化倡导和体现了对待马克思主义的科学态度和优良学风，不断开拓着马克思主义在中国发展的新境界。 如何理解马克思主义中国化两成果的关系两大理论成果：毛泽东思想和中国特色社会主义理论体系 两大理论成果一脉相承，与时俱进。毛泽东思想是被实践证明了的关于中国革命和建设的正确的理论原则和经验总结.中国特色社会主义理论体系是对马克思列宁主义、毛泽东思想的继承和发展，是被实践证明了的关于中国建设、巩固和发展社会主义的正确的理论原则和经验总结。 毛泽东思想是中国特色社会主义理论体系的重要思想渊源 中国特色社会主义理论体系在新的历史条件下进一步丰富和发展了毛泽东思想 毛泽东思想和中国特色社会主义理论体系都是马克思列宁主义在中国的运用和发展 怎样把握毛泽东思想的主要内容和历史地位毛泽东思想的主要内容 新民主主义革命理论 社会主义革命和社会主义建设理论 革命军队建设和军事战略的理论 政策和策略的理论 思想政治工作和文化工作的理论 党的建设理论 除了上述这几个方面外，毛泽东思想提中还有关于国际战略和外交工作的理论，关于思想方法和工作方法的理论，等等 毛泽东思想的灵魂，贯穿各个理论的立场、观点和方法，有三个基本方面：实事求是，群众路线，独立自主。 毛泽东思想的历史地位毛泽东思想是马克思主义中国化的第一个重大理论成果。它是马克思列宁主义在中国的运用和发展，是被实践证明了的关于中国革命和建设的正确理论原则和经验总结，是党和人民实践经验和集体智慧的结晶。 马克思主义中国化第一次历史性飞跃的理论成果 中国革命和建设的科学指南 党和人民的宝贵精神财富 怎样把握中国特色社会主义理论体系的主要内容和历史地位主要内容 中国特色社会主义的思想路线 建设中国特色社会主义总依据理论 社会主义本质和建设中国特色社会主义总任务理论 社会主义改革开放理论 建设中国特色社会主义总布局理论 实现祖国完全统一的理论 中国特色社会主义外交和国际战略理论 建设中国特色社会主义的根本目的和依靠力量理论 国防和军队现代化建设理论 建设中国特色社会主义的领导核心理论 历史地位 马克思主义中国化第二次历史性飞跃的理论成果 新时期全党全国各族人民团结奋斗的共同思想基础 实现中华民族伟大复兴的中国梦的根本指针 社会主义建设道路初步探索的理论成果 党在中国社会主义建设道路的初步探索中取得了哪些重要的理论成果 调动一切积极因素为社会主义事业服务的思想：调动一切积极因素为社会主义事业服务，是党关于社会主义建设的一个极为重要的基本方针，对于最大限度地团结全国各族人民，建设社会主义现代化国家，具有长远的指导意义。 正确认识和处理社会主义社会矛盾的思想 关于社会主义的基本矛盾 关于社会主义社会存在两类不同性质矛盾的理论 关于我国社会的主要矛盾和根本任务 走中国工业化道路的思想 初步探索的其他理论成果 关于社会主义发展阶段 关于社会主义现代化建设的战略目标和步骤 关于经济建设方针 关于所有制结构的调整 关于经济体制和运行机制改革 关于社会主义民主政治建设 关于科学和教育 关于知识分子工作 如何认识党对社会主义建设道路初步探索的意义 巩固和发展了我国的社会主义制度。 为开创中国特色社会主义提供了宝贵经验、理论准备、物质基础。 丰富了科学社会主义的理论和实践 党对社会主义建设道路的初步探索有哪些经验教训 必须把马克思主义与中国实际相结合，探索符合中国特点的社会主义建设道路 必须正确认识社会主义社会的主要矛盾和根本任务，集中力量发展生产力 必须从实际出发进行社会主义建设，建设规模和速度要和国力相适应 必须发展社会主义民主，健全社会主义法制 必须坚持党的民主集中制和集体领导，加强执政党建设 必须坚持对外开放，不能关起门来搞建设，要借鉴和吸收人类文明的共同成果建设社会主义 建设中国特色社会主义总依据 社会主义初级阶段的科学含义和基本特征两层含义 我国社会已经是社会主义社会。我们必须坚持而不能离开社会主义。 我国的社会主义社会还处于初级阶段，我们必须从这个实际出发，而不能超越这个阶段。 基本特征 现代化发展的水平上：逐步摆脱不发达状态，基本实现社会主义现代化的历史阶段 产业结构状况上：由农业人口占很大比重、主要依靠手工劳动的农业国，逐步转变为非农业人口占多数、包含现代农业和现代服务业的工业化国家的历史阶段 经济运行方式上：由自然经济半自然经济占很大比重，逐步转变为经济市场化程度较高的历史阶段 文化教育发展水平上：由文盲半文盲人口占很大比重、科技教育文化落后，逐步转变为科技教育文化比较发达的历史阶段； 人民富裕程度上：由贫困人口占很大比重、人民生活水平比较低，逐步转变为全体人民比较富裕的历史阶段； 地区发展状况上：由地区经济文化很不平衡，通过有先有后的发展，逐步缩小差距的历史阶段； 体制改革上：通过改革和探索，建立和完善比较成熟的充满活力的社会主义市场经济体制、社会主义民主政治体制和其他方面体制的历史阶段； 精神文明建设上：广大人民牢固树立建设有中国特色社会主义共同理想，自强不息，锐意进取，艰苦奋斗，勤俭建国，在建设物质文明的同时努力建设精神文明的历史阶段； 国际比较上：逐步缩小同世界先进水平的差距，在社会主义基础上实现中华民族伟大复兴的历史阶段 第一条和第九条是对社会主义初级阶段基本特点和历史任务的总概括，其他七条是对社会主义初级阶段基本特点和历史任务在经济、政治、文化等各方面的展开。这九条充分体现了社会主义初级阶段历史发展的过程性特征。 如何认识社会主义初级阶段的阶段特征社会主义初级阶是一个相当长的历史发展阶段，在不同时期会显出不同的阶段性特征，是“长期性”与“阶段性”统一的动态发展过程。 新世纪以来，我国进入了全面建设小康社会、加快社会主义现代化的心得发展阶段。尽管社会主义初级阶段的“基本国情”、“主要矛盾”和“我国作为世界最大发展中国家的国际地位”没有变，但经济和社会发展出现的许多新情况、新变化，显示出了一系列的阶段性特征。 长期性：社会主义初级阶段的长期性，从根本上说是由中国进入社会主义的历史条件和建成社会主义所需要的物质基础决定的 阶段性 首先，经济实力显著增强，同时发展中不平衡、不协调、不可持续的问题依然突出。 其次，经济社会发展取得全面进步，同时发展面临新的重大结构性问题，影响发展的体制机制障碍依然存在。 最后，对外开放日益扩大，同时面临的国际竞争日趋激烈。 社会主义本质和建设中国特色社会主义总任务 怎样准确把握邓小平关于社会主义本质的科学论断邓小平关于社会主义本质的概括，既包括了社会主义社会的生产力问题，又包括了以社会主义生产关系为基础的社会关系问题，是一个有机整体。社会主义本质的科学内涵就是：解放生产力，发展生产力，消灭剥削，消除两极 分化，最终达到共同富裕。 基本内涵包括两个方面 突出强调解放和发展生产力在社会主义发展中的重要地位。强调解放和发展生产力在社会主义本质中地位 突出强调消灭剥削，消除两极分化，最终达到共同富裕。社会主义就是要使全体社会成员过上富裕幸福的生活 为什么说解放和发展社会生产力是社会主义的根本任务社会主义的根本任务是发展生产力。这合乎科学社会主义的基本原则，体现了中 国社会主义初级阶段发展实践的迫切要求 原因： 高度发达的生产力是实现社会主义的物质基础。 我国的社会主义是在经济文化 比较落后的基础上建立的，没有经历一个资本主义充分发展的历史阶段，发展社会生产力的任务尤为艰巨 解放生产力是为促进生产力的发展开辟道路。生产关系要适应生产力的发展。生产关系既不能落后也不能超前于生产力的发展。只有不断变革同生产能力发展不相适应的生产关系和上层建筑，为生产力的发展扫清障碍，才能促进生产力的发展。 解放和发展生产力是中国特色社会主义根本任务。社会主义的根本目标是实现共同富裕，进而实现人的自由而全面发展。要实现这些目标，根本途径是解放和发展生产力 党的十八大对全面建成小康社会提出了哪些新要求党的十八大提出“为全面建成小康社会而奋斗”。党的十八大根据我国经济社会发展实际，从五个方面提出了全面建成小康社会的新的目标要求： 经济持续健康发展。 实现国内生产总值和城乡居民人均收入比2010年翻一番 人民民主不断扩大，依法治国基本方略全面落实 文化软实力显著增强，全民文明素质和社会文明程度明显提高 人民生活水平全面提高，基本公共服务均等化总体实现 资源节约型、环境友好型社会建设取得重大进展 社会主义改革开放理论 为什么说改革开放是发展中国特色社会主义的必由之路 改革是社会主义制度的自我完善和发展，改革是社会主义社会发展的直接动力。 改革不是对原有体制的细枝末节的修补，是一场深刻而全面的社会变革，它既包括经济体制又包括政治体制、文化体制、社会体制、生态体制，既涉及生产力又涉及生产关系，既涉及经济基础又涉及上层建筑，既包括体制层面又包括思想观念层面。 从解放生产力、扫除发展生产力的障碍这个意义上来说，从政策的重新选择、体制的重新构建的深刻性和广泛性来说，从由此引发的社会生活和人们观念变化的深刻性和广泛性来说，改革是一场伟大的革命。 如何理解全面深化改革的总目标重大意义： 极大地解放和发展生产力 解放社会主义基本矛盾和发展过程中的各种难题，化解来自各方面的风险和挑战，更好地发挥中国特色社会主义制度优势 改革开放最重要的是坚持党的领导，坚定走中国特色社会主义道路，加强顶层设计和摸着石头过河相结合，整体推进和重点突破相促进，提高改革决策科学性，广泛凝聚共识，形成改革合力。 目标任务：党的十八届三中全会指出，全面深化改革的总目标是完善和发展中国特色社会主义制度，推进国家治理体系和治理能力现代化。 建设中国特色社会主义总布局 社会主义初级阶段基本经济制度的确立，在社会主义所有制理论上实现了哪些重大突破和创新社会主义初级阶段基本经济制度的确立，在所有制结构理论和实践方面实现了重大的突破和创新。 社会主义初级阶段基本经济制度是一个有机统一体，它既包括社会主义经济基础公有制经济，又包括非社会主义性质的其他所有制经济，它将社会主义的本质内涵与初级阶段的现实要求有机结合起来，有利于社会生产力的发展、社会主义制度的巩固和发展。 社会主义初级阶段基本经济制度的确立，标志着我们党对社会主义初级阶段所有制结构的认识不仅在理论上有了重大的突破和创新，也在实践方面是我国进入了以公有制为主体、多种所有制经济共同发展的历史新阶段 如何正确理解坚持党的领导、人民当家作主和依法治国的有机统一 中国共产党的领导是人民当家作主和依法治国的根本保证。 人民当家作主是社会主义民主政治的本质和核心要求，是社会主义政治文明建设的根本出发点和归宿。 依法治国是党领导人民治理国家的基本方略。要把党的领导、人民当家作主、依法治国有机统一于中国特色社会主义民主政治的伟大实践中去。 总之，党的领导、人民当家作主和依法治国必须统一于建设中国特色社会主义民主政治的伟大实践之中，决不能把它们分割开来或对立起来。 如何培育和践行社会主义核心价值观富强、民主、文明、和谐——价值目标 自由、平等、公正、法治——价值取向 爱国、敬业、诚信、友善——价值准则 培育和践行社会主义核心价值观是一项复杂的社会系统工程，必须与各方面工作有机融合、协调发展。要坚持先进性要求与广泛性要求相统一，把培育和践行社会主义核心价值观的要求融入国民教育、精神文明建设和党的建设全过程，贯穿改革开放和社会主义现代化建设全过程，体现到精神文化产品创作生产传播各方面，坚持不懈用马克思主义中国化最新成果武装全党、教育人民，用中国特色社会主义共同理想凝聚力量，用民族精神和时代精神鼓舞斗志，用社会主义荣辱观引领风尚，积极运用社会主义核心价值体系引领社会思潮，凝聚社会共识，壮大主流思想舆论。任何社会要使其主流价值观念得到广泛认同并保持稳定性、连续性，必须使国家的法律法规和方针政策以及司法行政行为等很好地体现核心价值观念的要求。要把培育和践行社会主义核心价值观的要求体现到制度设计、政策法规制定和社会管理之中，从政策环境、体制环境、社会环境等多方面给予有力支撑，形成培育和践行社会主义核心价值观的强大合力。 怎样理解中国特色社会主义文化建设的根本任务和主要内容根本任务以马克思列宁主义、毛泽东思想、邓小平理论和三个代表重要思想为指导，全面贯彻科学发展观，培养有理想、有道德、有文化、有纪律的公民，着力提高全民族的思想道德素质和科学文化素质 主要内容思想道德建设和教育科学文化建设 怎样理解大力推进生态文明建设的重要意义良好的生态环境是经济社会可持续发展的重要条件，也是一个民族生存和发展的重要基础。 加快推进生态文明建设，深入实施可持续发展战略，是推动整个社会走上生产发展、生活富裕、生态良好的文明发展道路的重要支撑。我们要深刻认识加快推进生态文明建设的重要性和紧迫性，始终坚持和全面落实节约资源和保护环境的基本国策，树立尊重自然、顺应自然、保护自然的生态文明理念，把生态文明建设放在突出地位，融入经济建设、文化建设、政治建设和社会建设，建设以资源环境承载力为基础，以自然规律为准则，以可持续发展为目标的资源节约型、环境友好型社会。 建设中国特色社会主义的根本目的和依靠力量 为什么说新的社会阶层也是中国特色社会主义事业的建设者从总体上看，新的社会阶层的广大人员拥护共产党的领导和社会主义制度，拥护党的路线、政策和方针，遵守法律，热爱祖国。它们勇于开拓，敢于冒险，走出了一条艰苦奋斗、勤劳致富之路。伟大而又艰难的中国特色社会主义建设事业，需要全社会各方面的共同努力，将新的社会阶层的广大人员作为中国特色社会主义事业的建设者，是从实际出发，尊重实践，尊重群众所得出的科学结论。 中国特色社会主义领导核心理论 怎么理解党的领导是中国社会主义现代化建设的根本保证 坚持社会主义现代化建设的正确方向需要党的领导 维护祖国统一、社会和谐稳定需要党的领导 正确处理复杂的社会问题，凝聚亿万人的力量，共同建设美好未来，需要党的领导 应对来自复杂多变的国际环境的挑战，需要党的领导 为什么说坚持党的领导必须加强和改善党的领导坚持党的领导，就要不断改善党的领导。坚持党的领导与改善党的领导二者辩证统一。如果说坚持党的领导解决的是社会主义事业需不需要党，党在社会主义事业中的地位和作用的问题。那么改善党的领导解决的是进一步改革和完善党的领导方式和执政方式，更好地实现党对社会主义事业的领导问题。","tags":[{"name":"毛概","slug":"毛概","permalink":"http://yoursite.com/tags/毛概/"}]},{"title":"虚拟内存","date":"2017-06-28T01:42:38.000Z","path":"2017/06/28/内存管理/","text":"两个特点 进程中所有存储器访问都是逻辑地址，这些逻辑地址在运行时被转换为物理地址 一个进程可以划分为许多快，在执行过程中，这些块不需要连续地位于主存中 两个效果 在主存中保留多个进程 进程可以比主存的全部空间还大 请求分页(Demand Paging)只有程序执行需要时才载入页。 更少的IO需求 更少的内存需求 更快的响应 更多的用户 懒惰交换(lazy swapper)：只有在需要页时，才将它调入内存。 Valid-Invalid Bit通过维护一个页表来记录哪些页在内存中 Page Fault当进程试图访问哪些还未调入内存的页时，会产生page fault。 处理： 检查进程的内部页表，以确定该引用是合法还是非法的地址访问 如果引用非法，那么终止进程。如果引用有效但是尚未调入页面，那么现在调入 找到一个空闲帧 调度一个磁盘操作，以便将所需要的页调入刚分配的帧 当磁盘读操作完成后，修改进程的内部表和页表，以表示该页已在内存中。 重新开始因页错误而终端的指令。","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"Deadlock","date":"2017-06-27T14:27:27.000Z","path":"2017/06/27/Deadlock/","text":"死锁特征必要条件 互斥(Mutual exclusion) 占有与等待(Hold and wait) 非抢占(No preemption) 循环等待(Circular wait) 资源分配图死锁问题可用系统资源分配图的有向图进行更为精确描述。 从进程Pi指向资源Rj的有向边称为申请边，有向边Rj -&gt; Pi称为分配边。 在图上，用圆形表示进程Pi，用矩形表示资源类型Rj。由于资源类型Rj可能有多个实例，所以在矩形中用圆点表示实例。 如果分配图没有环，那么系统就没有进程死锁。如果分配图有环，那么可能存在死锁。 如果每个资源类型刚好有一个实例，那么有环就意味着已经出现死锁。如果环涉及一组资源类型，而每个类型只有一个实例，那么就出现死锁。环所涉及的进程就死锁。 如果每个资源类型有多个实例，那么有环并不意味着已经出现了死锁。 死锁处理方法 可使用协议以预防或避免死锁，确保系统不会进入死锁状态。 可允许系统进入死锁状态，然后检测它，并加以恢复。 可忽视这个问题，认为死锁不可能在系统内发生。 死锁预防(Deadlock Prevention)通过确保至少一个必要条件不成立 互斥通过资源共享，但是，通常不能通过否定互斥条件来预防死锁，因为有的资源本身就是非共享的。 占有与等待通过保证：当一个进程申请一个资源时，它不能占有其他资源。例如：每个进程在执行前申请并获得所有资源；或者，允许进程在没有资源时才可申请，在申请更多其他资源之前，必须释放现已分配的所有资源。 这两种协议的缺点： 资源利用率低 可能发生饥饿，一个进程如果需要多个常用资源，可能会永久等待。 非抢占可以使用以下协议：如果一个进程占有资源并申请另一个不能立即分配的资源，那么其现已分配的资源都可被抢占。 循环等待一个确保此条件不成立的方法是对所有资源类型进行完全排序，且要求每个进程按递增顺序来申请资源。 死锁避免死锁预防的方法限制确保四个必要条件之一不会发生，因此死锁不成立。然而，通过这种方法预防死锁的副作用是低设备使用率和系统吞吐率 安全状态：对于进程序列\\，如果对于每个Pi，Pi仍然可以申请的资源数小于当前可用资源加上所有进程Pj(其中 j &lt; i)所占有的资源，那么这一顺序称为安全序列。如果没有这样的顺序存在，那么系统状态就处于不安全状态。 安全状态不是死锁状态。相反，死锁状态是不安全状态。然而，不是所有不安全状态都能导致死锁状态。只要状态为安全，操作系统就能避免思索状态。 资源分配图算法银行家算法数据结构： Available：表示每种资源的现有实例数量 Max：n * m矩阵，定义每个进程的最大需求 Allocation：n * m矩阵，定义每个进程现在已分配的各种资源类型的实例数量。 Need：n * m矩阵，表示每个进程还需要的剩余的资源。 安全性算法：","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"重新开始","date":"2017-06-10T13:33:11.000Z","path":"2017/06/10/重新开始/","text":"Please enter the password to read the blog. Decrypt U2FsdGVkX1+oYBrMbcpEgAPRJOAoVjmwWTuhPa4QT7zztiHjWAR/XaGm3xjBd907dNwOCmAusKLHr6K1AaaVritKoqbVpYcQsT+lN3A9VZEmhLX4aSh74BNWm8nDyQYG8lyL+A+dvO/9STV6gEbtFGhZ6zf2iOWzN64J1x/sX+8pZm4JVxG1zIjaWUuf3bQRej5z4vKHvTLTNdgiJdvCLahUK79eeEbAinPwqI9I4BeOKoLmmTTU67eYkSomOzmg3H4aaQnnnWSgaf0JVOC8ba5GMNSLTADIw/8M1WpXuv+YSc3tU8u4npXTj4URm154aMIzk7+EbwbWzmLnfj/2tsnznGTxFxEPgA6toL+z17gyApN3DdiOj2f8rSy4XxZZMDUBzkPxMPkJ8/Xj7gqiGXeuZ65p3zZXC2/4WVA33Nj3BceaVffg+js7kZfx7oT8rPouDxxLL9aSP2JWFuKYHrCnKgykzneF/aUYums2yp1fuEAAEdHWjLA5jdwfWS11E82quFQ8qfAR1GwTWfdKT8sgNOvtx2O8I8IqFCoRN7Wrsi+YiMorsk+MYpmu3jh7EgVu+EbSPBEc9ePPoX3MQT8k21PS04argS2VWfiXG+nFf1LR0HfMld3LdtUJpH8uSNc2ltJ8ndw8/kODzzBE/vP89Kaw3x5/I0bhmWvT4xtPaLU5GDC5tD5t4neOP3y8","tags":[{"name":"记录","slug":"记录","permalink":"http://yoursite.com/tags/记录/"}]},{"title":"2017年6月9日23:44:21","date":"2017-06-09T15:44:24.000Z","path":"2017/06/09/2017年6月9日23-44-21/","text":"今天算是成功的第一天吧。 虽然算是以毒攻毒，也颇有点杀敌1000，自损800的意味，但总算还是有点成效了。 晚上，家里来电话。看的出来，老父每次打电话过来都会找个理由。兴许也是在家闲得慌。 老母亲还是像往常一样，道听途说来一些法门，让我去实践一番，我也如往常般不耐烦地答应。 问及什么时候家去，些许无奈。只能说，现在不玩儿命，怕是要被命儿玩。 记得以前在朋友圈看过有人说到不理解放假不回家的人。 唉，现在想想是有点何不食肉糜的感觉了。","tags":[{"name":"随写","slug":"随写","permalink":"http://yoursite.com/tags/随写/"}]},{"title":"随写","date":"2017-05-30T13:17:14.000Z","path":"2017/05/30/2017年5月30日21-18-51/","text":"本来是不想写的，像往常一样，过两天心气儿过去了，就平静了。但终于还是决定写下来。 这个端午假期过得还是波澜不惊的，上课，小聚，会，吹水（一如既往还是很能吹），宅宿舍。唯一有点不同的可能是最近想的比较多吧。 记得那天下午，老pa喊我出来一起吃饭，刚下课很累，回到宿舍打算躺一会儿。6点的时候，打算出门的时候，一个舍友恰好回来，在我看来，他总是一个人独来独往，仿佛是没有什么朋友的（说多了）。在我刚要出门的时候，看到他一个人拿出带来的粽子津津有味地吃着，突然间，我仿佛感觉到了什么叫做“一个人在外面过节”，而可以预见的是，在未来的很多年，我也会一个人在外地度过很多很多的大大小小的节日。“自是人生长恨水长东”，以前高中的时候，读到这句，总是很固执地要翻译成“从此以后，人生将会有长久的遗憾，像那东流而逝的江水”，其实，那时又懂得什么呢？自己的那些“强作愁”的酸腐八成是闲得蛋疼闲出来的。但是，而今，却又是确确实实地为未来担忧了起来。 团剧中的郝兽医在死前和孟烦了说：“我要是死了就是伤心死的”，郝兽医至死还是收着孟烦了写给他的那一纸荒唐言，他的一生就被这一张戏谑的纸就讲尽了，讲尽了： 初从文，三年不中；后习武，校场发一矢，中鼓吏，逐之出；遂学医，有所成。自撰一良方，服之，卒。 郝兽医一生的写照为这样的笑话覆上了一层悲剧的色彩，作为一个军医，从来没有医好一个伤员，总是一个人拉着那些无奈而死的娃儿去到坟头，喂他们最后一口死人饭…… 当最后他唯一的儿子在中原战区战死的消息从战友的书信中传来的时候，饱受沧桑的，不再年轻的心也随着自己的儿子，长眠于这满目疮痍的地底下。他确实是伤心死的。 而我，可能，就是在担心中死的。在安逸和漫不经心与偶尔的踌躇满志中死的。龙文章说：“中国人死于漫不经心和听天由命”。很不幸，这样的中国人就包括我，尽管多了一点偶尔的踌躇满志，不过也就是五十步和一百步的区别罢了。 作为这么一个粗糙的经常性的利己主义者（不知道有没有这样的表述，姑且算有吧），这可能也是这么多年我始终觉得自己差那么点意思的原因吧！这点意思可是害惨了我啊！ 【好了，个人感慨发表到这里，再说说最近遇到的一件事情吧】 昨天晚上的时候，某君微信让我帮忙做计组实验。通过抄我的代码，然后我讲解使其可以通过TA（Teacher assistant）的提问（此处应有微笑表情）。虽然没有严词拒绝，不过我并不想回复他，因为这样的要求我无法接受，而其中有一句更是令我火大，这样做的原因只是因为要结课了，再不做就会挂科重修。在这一学期当TA的经历中，说实话，有些人给的印象挺深刻的。其中就有一个学生，因为直接提交了网上博客的代码被抓到，当询问原因的时候，他的回答却是建议我直接挂科，这样他不用再为了这一点分数苟且，重修也许是更好的选择。说实话，当我看到这样的回复时，我是很赞赏的。所谓不破不立，大抵就是如此。当然后来有没有挂他我就没有去跟了，仅仅是将情况反映给了老师而已。说回某君吧，这样通过一两招小聪明来“续命”，虽然有不少人是这样做的（当然与我无关），实在是不值当的。 这个帮不帮的问题我倒是没有考虑多久，考虑得比较久的是要不要提醒他放弃这样的方式，最终我还是没有回复他。因为每当我燃起这样的冲动的时候，总是能想起两件事情，一件是在我高中的时候，偶尔的时间，在我的日记中写下的那么一句话：”忌！好为人师“。另外一件事就是雷教主时常的告诫：”做事情切记别感动了自己“。好了，这样的两个原因已经足以说服我了。我宁可相信，是我，误会你的梦想了，再见，好自为之。 【好了，再说回自己吧】 一个朋友跟我一样，有写日记的习惯。记得他曾经跟我说过：”写日记的目的，就是当你回首往事的时候看到曾经的自己，能够开心地笑出声来。“诚然，他说的有道理，不过，直到现在，我却始终不敢再翻开曾经的日记，而是用厚纸板加上胶布层层地包裹，藏了起来。往事总是不堪回首，现在的我还没有足够的境界能够波澜不惊地看自己曾经幼稚的文字，并且笑出声来。这或许就是”未老莫还乡，还乡须断肠“吧。 夜深了，搁笔不写了，以最近看到一段令我颇为感动的16年前的录音作为结尾吧。 “呼叫81192，这里是海航553，我奉命接替你机执行巡航任务，请返航”。 “81192收 到，我已无法返航，你们继续前进，重复，你们继续前进”。 注：这是2001年4月1号美国EP-3E“白羊座”进入我国南海海域上空活动，座机编号81192的飞行员王伟在与美军机发生碰撞坠毁前的录音。 81192相关视频链接 最后，还有一句话想跟自己说说： 大丈夫做人做事的道理，已经跟你说了，希望你能懂。","tags":[{"name":"随写","slug":"随写","permalink":"http://yoursite.com/tags/随写/"}]},{"title":"继承中成员函数名字查找","date":"2017-05-26T16:06:22.000Z","path":"2017/05/27/继承中成员函数名字查找/","text":"继承中类成员的名字查找要理解继承中成员函数的调用过程首先我们必须先了解一些概念 静态类型 : 静态类型是指在编译是已知的的，是变量声明时的类型或表达式生成的类型 动态类型 : 动态类型则是变量或表达式表示的内存中的对象的类型，动态类型直到运行时才可知 继承中的类作用域 : 每个类定义自己的作用域，派生类的作用域嵌套在其基类的作用域之中 接下来正式介绍其中的函数调用中的名字查找 假定我们调用p类的成员函数mem(), 分为以下4步： 首先确定p的静态类型 在其静态类型中查找mem，如果过找不到，则依次在其直接基类中查找直至继承链的顶端，如果找不到则是编译错误 一旦找到了，进行常规的类型检查（检查参数的个数，类型等）用于确认调用合法 假如调用合法，在根据调用的是否是虚函数产生不同的代码 如果mem()是虚函数，而且是通过指针或引用调用的，则根据动态类型在运行时决定调用哪个版本的虚函数 如果不是虚函数，或者是由对象直接调用，则直接就是常规的函数调用 值得一提的是第二步与第三步之间体现出的思想——-名字查找先于类型检查，这很好的解释了子类对其基类函数的隐藏 12345678910111213141516171819class Base() &#123; void f(); &#125;class Derive() : public Base &#123; void f(int); &#125;int main() &#123; Derive D; Base* bp = &amp;D; Derive* dp = &amp;D； bp-&gt;f();//正确调用Base::f() bp-&gt;f(1);//编译出错，虽然其动态类型中Derive 有f(int) 但是函数名字查找是从静态类型开始的，而f(int)在基类Base中不存在; dp-&gt;f();//错误，看似正确因基类中有f()这个函数，但是由于名字查找先于类型检查，编译器由静态类型开始查找在Derive作用域中找到了f名字的函数就停止名字查找了，然后就进行类型检查所以就出错了 dp-&gt;f(1);//正确调用 &#125;//这时可以通过在派生类中的采用using f，来将基类作用域中的f函数（包括所有重载版本）引入派生类的作用域中可以让其成功调用; 继承类型在继承体系分为3种函数： non virtual 非虚函数 virtual 虚函数 pure virtual 纯虚函数 这三种函数对应不同的继承类型，继承接口，继承实现 其中非虚函数要求其子类继承接口和强制继承其实现（要求不要重写，以公有继承为例，重写违背了is-a 的要求） 虚函数要求其子类继承接口和一份默认实现（子类可以选择自由选择是否重写） 纯虚函数要求函数继承接口（要求子类种一定要有该函数和一份自己的实现） 123456789//举一个&lt;&lt;effective c++&gt;&gt;中的一个例子AirPlane &#123; virtual void fly() &#123;...&#125;&#125;ModelB : public AirPlane &#123;&#125;ModelB bAirPlane* a = b;b-&gt;fly(); 上面的例子fly（）是一个虚函数，ModelB中是并没由写fly（）函数，继承了一份默认的实现，但是该代码可以顺利通过编译，可以调用基类中的fly(), 这是不合逻辑的。我们可以通过将基类fly函数定义为纯虚函数来在编译的时候就发现该错误。 123456789AirPlane &#123; virtual void fly() = delete; &#125;ModelB : public AirPlane&#123;&#125;ModelB b;AirPlane* a = b;b-&gt;fly();//编译出错 ' error: use of deleted function 'virtual void AirPlane::fly()'' 分析一下两份代码的成员函数调用： 都是查找到了基类中的fly函数，由于第二份声明为纯虚函数在尝试调用是发生了编译错误.","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"虚函数与动态绑定","date":"2017-05-16T14:39:50.000Z","path":"2017/05/16/虚继承和动态绑定/","text":"虚函数定义基类将类型相关的函数与派生类不做改变直接继承的函数区别对待。对于某些函数，基类希望它的派生类各自定义适合自身的版本，此时基类就将这些函数声明成虚函数。在C++语言中，当我们使用基类的引用或指针调用一个虚函数时会执行动态绑定。因此我们直到运行时才能知道到底调用了哪个版本的虚函数，所以所有的虚函数都必须有定义 动态绑定定义如前所述，当使用基类的引用或指针调用一个虚函数时将发生动态绑定。此时，函数的运行版本由实参决定，即在运行时选择函数的版本，所以动态绑定也被称为运行时绑定。 静态类型和动态类型当我们使用存在继承关系的类类型时，必须将一个变量或其他表达式的静态类型和动态类型区分。 静态类型在编译时总是已知的，是变量声明时的类型或表达式生成的类型 动态类型则是变量或表达式表示的内存中的对象的类型，直到运行时才可知 如果表达式既不是引用或指针，则它的动态类型永远与静态类型一致，基类的指针或引用的静态类型可能与其动态类型不一致。 虚函数的调用通过一个例子来学习： 123456789101112131415161718192021222324252627282930313233343536#include &lt;iostream&gt;using namespace std;class A &#123;public: A() &#123;&#125; ~A() &#123;&#125; virtual void print_classname() &#123; cout &lt;&lt; \"A\" &lt;&lt; endl; &#125;&#125;;class B : public A &#123;public: B() : A() &#123;&#125; void print_classname() override &#123; cout &lt;&lt; \"B\" &lt;&lt; endl; &#125;&#125;;void print(A&amp; t) &#123; t.print_classname();&#125;void print2(A t) &#123; t.print_classname();&#125;int main() &#123; A a; B b; print(a); //打印出A print(b); //打印出B print2(b); //没有发生动态绑定，输出A&#125; 注意到，A是一个基类，且其中有虚函数print_classname，而B是A的一个派生类，注意到B中关于print_classname的函数声明前面没有virtual关键字，这是因为基类中的虚函数在派生类中也默认是虚函数；而且B中print_classname参数列表跟着的override关键字，是c++11标准中允许显式地对继承来的虚函数的重新定义。 当虚函数通过指针或引用调用时，编译器产生的代码直到运行时才能确定应该调用哪个版本的函数。被调用的函数是与绑定到引用或指针上的对象的动态类型相匹配的那一个。 正如上面代码中，可以看到print函数通过基类的引用作为形参，而在函数体中通过基类的引用调用print_classname。此时，就发生了动态绑定，可以预料到，程序运行的结果就如注释中一般。 注意到main函数中最后调用的print2函数，当我们通过一个普通类型（非引用非指针）的表达式调用虚函数时，在编译时就会将调用的版本确定下来。 派生类中的虚函数当我们在派生类中覆盖某个虚函数时，可以再使用virtual关键字指出，但不是必须，因为一个函数一旦被声明为虚函数，则在所有的派生类中都是虚函数。 一个派生类的函数如果覆盖了某个继承而来的虚函数，则它的形参类型和返回类型必须与被它覆盖的基类函数完全一致。但存在例外，当类的虚函数返回类型是类本身的指针或引用时，派生类中的虚函数的返回类型不需要与基类中相同。 虚函数与默认实参同其他函数一样，虚函数也可以拥有默认实参。如果某次函数调用使用了默认实参，则该实参值由本次调用的静态类型决定。 即如果我们通过基类的引用或指针调用寒素，则使用基类中定义的默认实参。即使实际运行的是派生类中函数版本也是如此。","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"2017年5月13日00:26:04","date":"2017-05-12T16:26:18.000Z","path":"2017/05/13/2017年5月13日00-26-04/","text":"今天真是","tags":[{"name":"随写","slug":"随写","permalink":"http://yoursite.com/tags/随写/"}]},{"title":"2017-05-10 23:39:32","date":"2017-05-10T15:39:40.000Z","path":"2017/05/10/2017-05-10-23-39-32/","text":"最近喜欢上了蒋明的歌！ 虽然还没到中年，但还是很有feel啊！ 本来是有一肚子牢骚发的，偶然听到了这首歌，虽然没有歌词。 继续生活吧 要热爱生命，像叶开，像王小波。","tags":[{"name":"随写","slug":"随写","permalink":"http://yoursite.com/tags/随写/"}]},{"title":"随写","date":"2017-04-21T16:15:58.000Z","path":"2017/04/22/2017-04-22-00-15-51/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX1+UW4YFSI7LwTPwdY6BL7bo/Zjr2ZbK0JWOFoc/NmMQXcIxe+Q9aJCcFWEn1dYAU3SFxLmpK1ibEKbXgmKufo/oNWjCYm2znBn17Pzwo/v+9l00P/ekwE/so2jEYYOOMjmv4XAsmShVQOI/KrvODNy7YEeaijI9is+iyanchA67M5F/E8AOtHlvpR9Zh/lrC9OeGbIWQvd833mgo0sY3IxeCDDOJFbg35k3Gg3ECf8LSIDIa0HzTAd6pDuWSVNaib04Zxpo2NvRIxCKhnru5He4EUjkGZk6fN+JHipcOoEulM7O2Ugg+BizHN3u7yIGCb/DExRcNtKnJKVSs0dufjjpR92Q+q3vxNHMZHtX4PB3Tr1m/sFJECvwBDv/mkXHG//o1lB5+QyDrsPUAXNzCsTYAjZ0pxHA+AgfEWafLpbIr7gNqLnUbVolxvk5T6g9ZzfhJXXq+300GMQx8+o6gLHa9sEFI2efbjvpCYAsJThxYs/Eypo5MR8VslcYo3DP6iyfZPXeLjACwK68B/ICpxD6x3Sb9uYPWoENwAtMgRi5gawFNtRSRybo+LKxAwhNH/sJMEDKV1W8sKct8EU1RFlBA7JRBixo0S8o3f31Ts+tdj/ih9sBJMN9bnyPf8P7j1C+U7mLQ+NgTUO+1PQ9L+6aKjgBLX6bNWvYTs97pcVA4pFHKHjB+QJO+eGRFPlW7CwAZx02fTGkYqekHgaPTjuEMmavVT+WqLclaJIYHSz8HeQSZOZn8JLeB1Ldteb/e5Qu3GKv2NUoU3jiBAVu1Qcs7Scue6f082COxcbdTfCvOwVT63GMxaFvveRMReNnCFY1uojQuqgdDpwyIMOWbrJnDUehgp+5AGTHlW82te5OukoMzlQb/pqrUdVQFIwh37ZLk5hbb/1Y0dmiY8hK8WsotXkU5MpmwT+n/+7cQSDdW6rbPNrtVPeHplU98/dwuT1wZx9dSWhLDOp77i7p/ljmcD/cLcMbUT1GPPIXXopKmlXqsJflF4aKKMiuAdSsr9yX4cG8idlyH4ENTLvefp8KbG4RjlH5i+dUxffgIeDxFk17RtVRJ6Fy3DJ7uBr1Ol3mKKFF6+c5QzvVBIiUfIUHveXH3O5bCrKn/31eQNnQZjdtqHrt1owGZhhO2HiAeX7Jg3iruIQPm0rZZdwJmH+chpRy4Y7XLWcGRPHNu10Ks+LLT4xzTgBR2+eHhwTwFusV+wRCPshCeAiVQidjGptQKbCEWqF5KrDScaP8KZrIpjzexy/Ym8ZLT2+TBHi8VLnkn57EOT6YAyrz6pEb/xBq/dZpNVIINSr7WpTPK/DfsS2vNTWl8FttU9sf1SMdbtQ2Z8ybC1UPSfUXIxaG9R/S2U/yznPDiH+SxUru2gaU8XVVNbHnNkp+b2XcADPjLePfLNQz+bjoukt0rJCxuVgv4NN6YYFMr6ivWUe3V4WCtInPkdX3gl4O7W9/EmOfz41MVBAxSq/fl3ouJgB9q48j4gvTHgcluLdOne+Nn3IjpkOsC1tokgiXljNuvMzTMOYZUZPC+Kc9VekC2JzpEeB6E0ZqdO46eSBbbkheFErSNp4nwnL1Ujf4Lwjw2/5MQ86g1FeOrNQysqR+D4sY9k6HTzRTPlyiTy7xbp4zyYeWX7iQX9pD254ncGSC+AlhhLESOVz1E2zSy50cya54ybEpDbC9msGyf/3QgMI/CkOoyuxb4fj3ATzn9PKFWYzQ0XeCkbLnu3qoaia7YBzPQE1B/tpyeYtEyhKuYxuv/4aSi+Dxekrvur+VUGJdhTDOJk/z24j+5d/+f7dyLZV4u2/LwdoP2+SUUROfZX2aql1FD7V0HbzoXmKjdHFl40LXMSLHti8QSWMrB45Qy9d3ym2aYs+uDRQRD5w3vhBL2exFkDS4vyOjHsFvib7gCI3eaO7bxq/BFtfPqcrroOYlBrSlgjc7J6PaiBQoFejJ/5JQtefXQuUDCKGXUzXedM/V7/nC5WJHe8yo9WE/sa76n/tIqsQrOFfK0wHhYZ2HifqyCy5IEhGH6MBzuASgA+bmXPq1mOxPTxGHb9GfRYw3OJIE2Rf9vBV9Ws1bavJrceayOS1+9S74FbL+HnTHmELnB9twH6TcKr3MJqfPCjOnl9hiOTP4BEH81XalyKpyaoR8l39dHNDT3PZgynOQW+7FjDk/2sI5our08EUPv9hTbRZjWnSjB4SZEmAxnNisQtUx13UpfdhU2ADWsZtGvwHyA/KN14HT3YrACrkyH1eWeX5JPW9H/r5GHaTDuP5Un/AT3JnF9dvutRtmtviYzEewx7i0oLAV+UX7cm+P4IQukcOFltA2srjCxezmNH0aolrd9iyyrNgqpSyvwBzXIU/dPN3ciTfWlB7nNFUdln2UQl7QYLZky9aZMPvv+AQpBsZcaA+RnORJT17FBIKELTKmx97Iyb9hZKlUCr65RTIz2pOzjzKZCfJVQTx9pQryk3txVYv+45b9LN4etDXk/UhD9O/H5gqpHTz1cThe+AlAQ4FkV3dkHIdz+/BaNMLVDANFLhWIXtB4HaMfrPC2wkcwqqRyu1ljt5CMPLj3GHwi08DjDI2QWKTlfsg1+6DFXL+4Ot7NFkzDQCCTqN8TdGg3r67ki8rcIOtjRqQsUXsMc9inxBNG/HbgJDMC0DwJUswQ2ztrSxYpz2mEbSsVtL7wa/yol+sOSRfi2tutBGhQjEbbBkePlhogiTpTKxgY/IRfkM64r1r7DyDfXihhbsiTRfqXjp+hzw4fy8tr0lUQrDvahquF4F02qu5g5ptMfN35e3JjnsvSqZBOrICLK/EpnUUxNNI0B4xQv8gK9yUzk0qvgBhaL44NmajxP4OWeTC4lkuNCo/QuONTX0L1GMq5315z2Ek9RIaZdjurnFlHJHcc18PGYRwZ5fus9cXsrzy4S9aYqeiypuUoxv/+phmirMC+A6Y03nNNKsi6H2+w9TV1+mYuuAT3DiAzEECsgPuPWTzkulnXB0aRnMZkn0Sl7N3lpgq/QIVQMH5n01S0AdbPk0ekdZx3nxptxjlHtcYrqOlrfgJTnXG6bEvHFXGnTgh4IIoIR49DUzeLTECLbSdMSUaj+ci+VZGe3kp39aiI8MlkOcaBMu9vALKMgLfhbbJ53MJsxAy1pqBWrTeaq7kipyGpAu+5/8yDxOpReHJSDp23tvG3f1Eoom9ZTuw94NH63rx3uGI7PmFQBzJtxI4ff4bXwSkP6fFt9liLhi3WAouOCenjUwRiHRjY8LIdMEj2J9fa23FeIIXkCgpotLjarTK08ljLSRkw4KvJH9qmGjW/57u0dKyQYW4dfscSKuiox4ANj+p/mo6sYz7zb/EPxEL///MWj+BzfnzekBU9iuYX/crA138WUgNe2+yqrZZsxfqbnODjtURdFsC0bl0OSruIRgnjF3Vfl50Do36D+kBCSkHQSI8BWdVZXJYEgRGUnTHAUNDuJjnssSBjtG3CbowazFyal50rKSA9PpMuf4/MrECrgbi2WGZm2C+nqwsZUT3VeBy901+bMsjqW3+tV4S3RdI8qFEy7aP+PpHyvVndOw8sTi611EF+lPDpNdClmGzr6F8VJgxgfVkOi0CB8iFZDSWgVuLSitxZk9dRPeDRqRvEj2XPLhZe89zKq9xMOM+WaDRtAGdX03Ps+bWBKy0nXXNHOMnTG4SAHjFgTn6vq2LVy3Z2JvsEmwbiM5WksoXA1BljAeK83Fjx3aTWFXBNjcyKNzE7v9K/rLNUcD/rSCvOCYcFSsG6fSBNfuzgV4iFXNAUtNwoapnUIda80VTsD9uRXSXgJw2H7yVVYsAC5ircoglo4wdzgLq2rscJzGWQHmZ4qhw5tzMzpc2DlkEWGjgEZw/PaQ7SC1PT9aqlvy/Kjny8VEbdk79PVJYU2y6+MXVNx0yrJw9IYFRksLERxBDvr3+FJE6vXZbMxD4t8WGA5/5wKGQZ19AZ5piSiOO34Rbz0h3lIbP1Mvjlubp2nsFqliBRwcHW+KGiejtKQ/Rm6HvOfkUTW/RxhF93tFEo33Q2M4rVCC/24X9DUB35OPqIR6yEV6N2bxDf91G6nmEeDrAVLdA9cCFJizHqi6HgkyJyMMVLmfZg6/iOVrgIlgRIXb9iB8I8r/6W7sPKesJfnM3VYW76DU8dqKHi99D8SwLa2xTJoPqteLuwS5pqO/UbRTnTprOARi69dMajlsML9D9TTZutMc3IN+o4mlg/0fr1S6lyeSTCC79a3LkW9j80OpJatA3qi2vwzwz6Bit7vp6yuzw1L2RoX9GZhowH6RQ4RIqEXRWuerFleL92akqTLuHTdIfP3jw6/3uNfqtvszuyuXGESMu7FShlOIw3t4UuSQjJDy7sPVMHGPtuYsyydxZZiiE+8oe3lNasWFOPnjY8WWn8nRVlIXjBWs05Yw68ahEpJ8jUIJoC+JjEqhtQykSR+D7YZ/Wu25ot/DT0o/moDfpvSgKXtOViRKTOPqrEkRcfzVHeRB1OggFj34ji23AQ0dIxZonIHdXN4OySxmgUrPSqkIjGBKzbFXhrFN0uVwaXidYCD4CeLb/+ZdzzRvbMZI4pM/T/L4jqVgqr04XPBXNdmNk+Dq1P4NgpyvwwkU2q2DEAL71ES6D+tKCupYh8SNk/KnO418MKlpGDxQejQeKaNaZ3TOZIinleeSBqg+NW3Sfvv92WuyJgmsg3RJGG8vExiedI5njKvB2VAUgC7pA2ZnULhN1DYy8JVzb+ISbEhjnaZHD04ePF5kBehK4KKvhRQVV8jGHOpWA2jUrz6RXMl9WNdooSoS2NbQ9slLu4KxizCa508VeDsDfT2KKMaxkaaXRfDOvLkAase/94wtGBV0T4H0Y4PGF+J68GTsykq0IvG1MmqQHW2nUc+5y0/RZolQqwWrNyjrH9BLXGAzVYIjiNDsnKYavb36IOuLyf6YI+35dU9KLgGwBBIyEjPTQAqIYnB9M5xAKbi9gk+YH8yeost6vS1ry3T02eiYQ1IUIo0zqlT1d23M2ww4PgKyTwtLMyKJua2DDX8/jgjhFuhp4viQ208w9XagBt9dG2fnbTqDjY/CkcWHeb6iRlvoAvl/pUl3fVyns/012CMDLZjU5cVNym9N9CX2E0gCrX0/OO7KTLG7TzSAN975YkbquyI4yfPl6CLF7bpqd4i1Tl/yu2pg+fhIEfcnsco2FeIbhg5EkDBBHW8b7Ay1GNTKytmodN/dJ+jJ2OXRe+yIVAcMV04gc1goQraNg2zgljqQsMYn3eNa1oFl/u2xuPOyYZEZs9ljRY7PJL2TEygyaytYU+RmA3CtA0mLjuqBuBoDXwWs9hyXXUkneNDkDtKPZ6zGccrCAA/sXTLNyXWnSA+4ASs2/ig1zZvkgyX9ugJN1siPof4yW0pjWceU6ZQQSIALt3Tv2snlpytVPSoII6bI++wa1/hUYiQhoRGHYhgryJ66egPNbNenH6t5M/mA4zBCLgbG/SfddjOf437pxvEbNtioMbUQ7hAn01UIuzNu1iOvdFk1cD+lMXHhnHGrAUaGJwuKey6XGCQ87RYPxrMiIf4qrmMOgC19J+5cKRT7nA4TR/kl7LN1T6pZlPSKo61Uu6jpFYKr1ViiG8VvgM2Lbe7yYaxpR5hrCHFrfQw15FRpD5288OeeMeKaCjb9s8fa71XE4a8Pp/pDTPnvZggfa666VV2Fu+lpLVH3yWnFaOqQExXLoeeug9hM0dVyMMAhNZqiP5IhwSOW45GCA3L1PLclExBlrRVoddPYX1RcXx6uSxggnpILiUdMC0ghqOAUuW+kp5qHCf9SPWTjdGtZ2s8pwl/XLlHUDlfcw8336g5WVujehFGko4jibDed6Xd0UwhEnT2DynYe/sXpIWDIZeRGOals0q16nYkwK3DcdgoheegDJSXv++i3qMwHkpWJVoIecUa3K3DTiC5wic3X3bozHDJL31QO8zRny1tNEQhz3ibVR/9e80GE1POGd9gxxMXnIzn3oWR/+payqS9NCcmc476ojmlJC59w/xwt2y8Bl8PAt/i10MJiVzpmkRQmyUhFdjcMpFknRjqLMEqPkB3fGrVk8AM/SWqmY32czQOWbd0Agm0TngeGfFZS7T7luKDA/oHbbacedE746z5eNqBEU1etUrBbg4Xagnr8gdDG4WZjfj7gsTdsFsq9HVenvUmfsVo01De/Du5gwgju7FKqs2XOxCPYXoHnd8bgLr5yM6WgGekvwqruX7QMMDO/YRNf6hvcf5UR7JRp5LEm0pjsCHsmf9ePjI15Ob+B8SF4v4DtxzGbtEMrvSENjd//6VHIzPDL/v5C6FNqQBqPRSG59aWgEhECve2iWFJxemmP/TIA65f5IsYHWG3a+JDLnVl0D48DLzxltxYDOIN6Hgy6tkTb9pK/92IWFrsrADgiI6GrhHaktWznFGr72lnTfwNmfLkBG1jRTfZtIvGOPrwVRi3d6+UyFp6fRB/HKEP5psEwQUcWSCUAugHIuftap+qKhAg3OpZQFn7IqFdOE2rAcMx+lYdz4HwXP/c8rvad+PrU0eSCMouDd7HgDi+fOhp3CgPuHUb1AGsu4FZR3XZCscQ0BSdNQoY5t9NliL8CIW2FT1zEXWpjS9ItspNpMlC6k+V8bE/QLltmXNvHsiRZ5IDe0HIR+8hPBJN1AaDnDD0Cm1fqf0+kZ+XB/f0zFB2z38cAYnLRe9QSF/ZhVqWv4s4QF2f3sokOrY86p9A3kv7DGXCnh9sBsHqUsPiss9z7OXKif5xe2JrGkPECRX288khLC+4KJ67ZVKT2HH2ottw5SDhnjhA9jOBkzzIT2VpF2s7qqOu16C/ZDxwMt17BC1bCiLAimrUELu0T0whJXdaWXn2OZgYxDK2RV6JGzJnUDfcfIe31AyfJWwrQuOwMmdXaSb5og6ZrRwYy6/7TpZSXSxfvmSfx+AUzbbpn9pECbfc/DMxAFSeZRSLvsap99R/0bqUm4oUIIsjk1d3TMR2/e0TagSpR2JEKdxOyldE45f8gugwsF8AQywucjaWkTTKiS1Qj+0Dn3P9XWkE3Wndf2PGjhGXvs1BKuzeLxR2uppOx07WP2Jju0JcupI7EtjM99icUXYicGErdckf31htIRjiV2tQem2WA1OYSK3vjtCLmqV25EXQZ+IrIyZUl9WM9SIiseMFyxO8s7sIt/0im6FGVYj0kg3t1qbB3a5Cq5tXZqUt2nf69hbArSNZjTa2VafSRiE3bWFz/+BIIM7kbl6oXlRE3AC/dR/Hql5udo/32m5osjxZCi9R4xjop3hSUSx9jqmnOvSZqZDTg0SHI2n5BqULccfdowklzmTqfmmaYREoYG2VJfw50d2+vQpb10HYb5b7HZ9B9MXe6Z1BYRQJ+hqSWKfSQx09F5xcfWdmu701epm7LYvPj6rAO6X10iqZTapUS5FhH7fUIZaiYjdlMVcdiRj7eu0PMjKb0dWpeZzcuS+vg5DgN8+NjkmIssmsv4oyUzeur0fQ5x3SCDlUglwJG2HO6z4FHUjrhnl3JdBi1IRvetrvW/RIiibg4Q0niNFd34QaNXEC66Pf+FDXVetkgYzcv9+OqugMOHs4B5VdhHCBf1Ke6CQ0NuNIwtrI1izXywO7jmxPKzA1q5b5DXJp34ZGw42+fNIWlRaZ18+385SVvgmMkSg4VgqC/ecwwYblW8T4SEeA2+yMrj7/ywG0sRhPSgBh4hmD8MCGny/0uhR/eXxxduDX1QpZEZs5eZMw+dyLVNO9t4LgrtJoXgXUcAqOOiHZmkUkqyfvKOkFCcLXt++oQPfannBLGbgoHUNfMS7si9D98E/SeaCiZvC95cr8jiybQtJ4i7P0wh39IMTdiMKNd2t12NFSdFSRbla3mpVG4DFdZL81I/tfIV49wtjj/AIkAMlXlOr+p+gY/wrJMH2E5z9zjLUgKg4DaYDoXJVh7g5mWGQpuvUlRhlyMWAZTPvU0qRLGSh3Hvuwmoz/ytkO6qu4arYZmKO6gdF4+iAUYkbnmaY0d0QiHRyu/bz9Sf9sxUxEq/nxQGTrTwDFAXrn7S/G82FtudkOVwjOaPMSOUAia/ohnwd4Z51xT43LUh0ca0/cAP/D/leQKtz7Ty/k3mdpUempOqsYFo94S1xcm2wmzX4+3GbJI3bZZ2ongvQX7F7VuHDgO6F69jMjQ8D9iTOxn3zNZNwI3HHRKk9CAyEcs+XmSr2JNE6NqsIIG0tSeKbzOS7Tq6YAm9tx8XJxP3jRVx7SNAhJFIXNcXQVGJD3o7u5AtQ2CHi6OEW+7GICGQ23hsDdrY7vXR6w7PWUB8zguLN9aTzOJLeTky1Nbhvf2EhFmNeVmrcQlnZitWvlPJkVyjyPw2O03b5jqwfNvkfSwz0jjpk7ImV6ryDlzRwJmTplvv4HErN5PcwGJiCxLcZIJ0DOBH4XDqDAb1HikHjDe3sJWPF9wyNRYV5v6NAWGIkw0q5rKh/a9PVnbLndGQ+anUu8uf+7AE1ARpceJ9NSQJP3LrzB1mCPTxFWhKP/3/dX/78CaF2OiesyaWjP4DBwIGrqmLX0bRpDjADmdem9W2YZ7lbDgr7WIJYJaJWJ1VfOxprtJpceDDJ8V5XxCTAp0ucR5LX5K5J9+Dx04jqLxLSdnRR9Hpi2O+h/ETMDkDunb2r3+yNE3tUrLLNWJZHtYOMzoocRYEBjyCMjZbTuY0A4PctTygUG5X23JQmWdwaN3G8M9pIBvYNdkkNQkJCnsJD9knBgEe578WeU2CE9PuplRmNboWgWyZweehPUpCX8YJOUJwCrueD1kJ0xJV+GZX5keIotKzffG9plYUGNajjH7CMCAXNrvoxr/J2l68IUDyqoq5N+Ew1M18Y/CX4jhu3VyGoBh/7CEzUw63Wg3YSFW5ymA+vd5NWTO1/R7Bjvvv4zxWAXYpzFgav9jWJ+gE7fcRi76yR+eTYTMMwrzpGobIfkp4MraV0PFJ8c5u29GTkZY3H9iDeXJgv4VPIRKHY7vBg1DvasLz4bElLGQY9KuIVCIH4rFXFcgM4t1poQPOKJ5yRH3ZL4nslu8Z4zKITYDRDz87CnVkgm2vYdv5Smwe0KgwMkLg+hVk/HT96x5kb14YDh6snwqGO0RaUhFEtGaPgY0wBNaNN0VoX6RmcXUvt3bSsq8EZhCpZ+foTfpFQLP4lkTy6qB7BCbLRjhcL9AiI02pAkwlMZHK3swaF0YBMp+fKPqkT6pG6r4hFDKBiZ6i9jaxCdP1ohpXQXG/e1EbZquR3MegJyunRLQgDdaDWPSDLYW2fAFMGahJkXzj0qBum2GBLJcSfH7Ncar1Q8S9thDmrojcZNz56qEt5bfkFRaHbay+0iQaLJva4L2Aeak7KKB7iDUdbaxlso6KMebPhelvtgKKhrnbqR+hzq3vqIfS7KQJV+FTWg+uunxo3aIRsVRdrzkCz/4FRR0kYwRCxez1PEHt0I0CnFOL1h1pNdIf30MlETfdR/iKQSuCbI2NCtb3Xj7vJb79285eYO20eHGDLNBO3budvoxCKOGcMeExjUvId/EuBKHS05XLUHLs+923ly9B+qTRzPMKKXSKNrN30i7rHkVTzLsKzjwmF87mQgBnFVX6pezfpdS5/+C9eE2MwYleyWJBX/W35dBRjWwH1OXUZLKJJWQ0O85BW2saQyp+Y09uXGswcdaE3+3ZUYKpTuZkgxvc0EsQLepFrSZe9mm8qKEkYuESnR6HwT1cdS967H55cufAMLvjAqpoTAZTAiZRcUp7QXnHzbAJblXS8hFhB6VVXdQoCoTYy6HqkdwnSjUSU2rmG31/bjrxDwWg2HO+pFHoeLGzMk+xh0KBCBoGx7gz23e8533EeQ5AFkGamo9g3a3PYkC3wQPmrMzlBCH/bET80Em6yXpbt0dtd0FibOh1cMHLnGQGASrM3QIS2uhcQQcZZAxIk4Eab+hOvFfbtIPwJnD4W4C9y+oQSdFZ3S9D/zOG5K+SU62BLzRENZM9Qhys24egHg2YkNuWXEtwW6xuqD6wPmjdlznJwwYqvwsVNMQ+nfeCTMaW92iCdAH9+A2fLDJwHKYvoiinyd6WA2a+tMhk5Bgd6xjkm+217M9Vi1c4u7Odog9PYCzqdRyhyng7+ASTkkQi9XYc1NOzZV1/KhqdbGs4SW0a6Ik2DgE/4M8n2ECymVnwzis2cu+7yP9r4dbgOgCCIHmtn76p700xSZ7oP4YTSTmmeQwNPFgiLtlYoYi8YgfEkb8T+ymuJYgFqXXDOv1MoPldnqwU4pqgeQm8Ut5wtTbIOyk/3B3cqxmWIbtI6CSpYzsEjq7oDoAfKntCQe0GGDtppljx6+tloChD6ZYAk6Gb5mHM6zgCCcdcKw6JyRBf/hroWHfY4bNnFH7JZmqSU4GnagL2YZpYP7N8dQvtQakeEm3Lx7V414MlWn9KNXIQR4jRRLGyz+X1qS4TQdWQAFTkUhkeptAkMiX2dX0fyRcHOWvcpPG76tYC3DnwaTtf4mLyeT3CHWWJrfTS3oOlCOF0+B1CxQfZ57iTkasxM78qpl9+fuYDTwSIH4++9usy5ax2nuCNxo0hShAVqsBS73XhfhUUVwl6Lh2ji2V+KX5nzVJiSKRRz6mEIPWbCyasuqNu0s1Pvz9lTPB2YoZDw9jR/5eHt36Ege22xjfUaRu7Luq6kw/Q73qbyRkzPlhVNtlOapJ6eH5kkbFoGK1jYEwaOPcN/rkViS1LAwDOJW/nMq2UR2ky2KqLtTwf+vIbB0h2TX/ooMYTOVKCcx4y1F/wAQNn9uIk1VDxMVnSZyBucp9M/z0LcGxAymzZpNaMREtTAl1zyI0u+r4w9rcYYjo0Tn/MaXvWGEL273FpuYnVLL+THGaw5wNgMNjZvLjV+3mKsltDAj6Wiyt3/6QdtfZYHfIncG2doTf7hXZOQ6pUz0EMgUII9vhvvimvO9f5LRH6Jki8g/6jOdfNxd8c0Xlh6GssFwjd+1Z9Bh0MjRKuzRdWnkZETCgTbgArfHZcAVtC1OsvQUnxtW7YXzKd3PJVm0LaWEWRKxa7iAoKc0rD5XEUDgblq2mfgNxPMNjtJ+xRG21BMMoZvXEUY8lZT4R+mOSoNhxtEeAH8NoLoBLB3JA9O9uKePDPSM5K2N36OXrjjXKUeJiDlPupUqm5Z6LzFcUY19Rd0kpc59aS2RQqmwbvUKxp3OxZqyZjLKrym+ID5NVqzpuF77OD31MzYcXaaPDYBZSUKpUn0lRM3fZNCz71xMmNpHr4d16lUifX6nh33JBlMcQqXxvsFkynjHQIDnePQ2kHa5kLvIMZW6KNYv98mc9tnUAWSQgygrhHswHTrh5tCKjatzohjfvSsli3RvMDFVTyvvdrxELRUMPzdqtHM8ydhrRvei/plUu7Qom5dKzBdrrUWUiRXXDWvZtYj5ks3UF19hGj0Tf38vfs+epUMdFa4gqPySwTalmxivl5cWZ37GTzugb/TUyDwm1iqp3dKOeCBvu6le8DfqYc60ELeVhpoVTn1FoQXP7zfDCWx43UdHBempTufx1ddUsaRWqopro44aELFjiGsSvCJWIeDLVpBCmrfJctrMcD2m1cMYDgFj6e+psLaqRM3nlGx0zulVqiBq9j4E/VdIUuaIFd9781OZjEQsI6jB6+AIZoyCdQbvIMfXy8/KcLhiYZOQl9hJbzBfwFFYouvwkvHVo2DKKUaGXDUSzz6XhzPiNc+LFRC8EuRryQ7zPGp+9foTG3+hE4J8sb+0+tJWornZTAdnmNtTBhjwSfVHSfROVWw+iZ2o0QmwCZE/LdKswTVVNbroe8D7nXUdkUsOsvOpAjKwRV2lYaYX6k32YelSr7ePHWWkDR27gayXfvpEiWA6l+b2KC04WSJR+nc5Q37JGuPI3WbeOGQ5zeI/1UflmnW/E/n0aREM5vlg40478zR4smzXSu9yZo12dvib3QXihelxJn5BiBxhCbcySW/1+o8IPYDVMJ5dAtBiX6qKb+uiYlT1cRO7G1euWDw2gQujQrIZfqXhjcxWkQ8YFLnmvZTqncZt2QJcVZ5qxj2CXf/hw3kW41k2qWMpRfNExVm1IpYHlJiFYulygzp1tSE2tM3mQ0c9+/54SvurBj/XfSbN54tkXeAttRnSrKn9jYC/SOrMiDloA5ZmMqUwbH8o4518Q6zCVsFqmYR4zlyZU50bkU1YdmcnbMDsD7FlUd9Mbk6T5W/8f9OMfoQ3kjhgeC9B01vst0Y7p/3wzwvFvZ9bdIkUXTytdj8t0Jk4i+4nRLu9Ft0GUtPbjcvOMUrYNpR33SMeDwncLUHrHXI7+p5cxYZQh7Pda2b8u5xqiD6NYJWe7sddUI2Zjro6aa+Arv7b4aPFMguP8hOi59eGkeur2Em4kaAMu8r0KHo47ex96jLBRFTUft6PLGHsnVpfrYIDgKTc2XNHdYAG639NM3445XYhSOpum4ftT0dQuKWCFmzeP9fIL15Q4aHZ4RkNunNZyOUs3EHdT1ZfgzMFkzRVPt5EvD7Z2hCBb0YN3/fpmnVZaBXAJpNQQxfXE40UC39pBAQYmP42ZH/u5sPENMdDCMiyyRQHsxkOhSiJbhMqdJb91wS4uzLrQrwW/4xz6w7N0MVkSqVXXvd2qGGp8VzUkLfDzU/i3jyq4F4c3GysJDjqcEY6Kk8d5gXagK56nTBCyfgeIEAzyEMde2v/8gXLhYNpkcacPdq8dzRdj8j4k/ifTGBJpRiGKphcygpJMjt0m+XUQjnVHq0iTvzwsg3yVIBEWm3lXUl8/qllojcjulZ962BCaNREVh13Vcfw2SA1VD2lGmYVHa15JXIXufoToQKltDNAT8dBNa25fjuz68OkLnq3YWe+Z0NUugHMu3qe8BX8JX6bllZd6j6P9KhuJOD3PBgSUjQt3l+1Fn+7gm3luCDlVPVrIckrWI/74feY1r0C02/JmUFqINuQKKN1T9lVMmjeBfHJnSsWqgt1JwX6yaGgNbpa9mY3isCnoaNkNoneVQl5BdNzAzxxi0iV/+Gv05FeZXe9qvV1b49m3omNe6QYTvDbaG5ogFuaiLM5gq0fR3bOvmCwgx+GzQnkC2loy8BlaZE042dXZpko+LtoP0aT0ISJp8l0YFElq2mvRTt4Z4+FvKJx03WP92Lz4kkZMtI0mtk96AHwlH0QYRj+k6iOu5re3WfVe7OXQJFnAPJc9t04OwViWSmeCD8lKAeiUWpRsK7kIvdLRzijXrrNuD3pYs6ZnI20RpLVmG9aORGpQpsS/fimm5VkjRpkt0OCEfpiUBZnWduu9+SARPZ9QzT72EgnwiMU5K0qe0CGeQAzX1KMKaHrCpqc12nBBMx6kol1N8hZWKRRluzbIiK9cgtXWLfOOzatf7oUVKStD9Q9+dANIHRVLvQxx0RjTjtdhj6cSvUnLY5NjL3EVzGXzqJZ8ZbQBN04Y15+o7JkwAmk02+3GQynLls8LolwT3S6K9qbXiZzLfmv4FdvSWcW/9vVocH6uRGeqFjIIqYFKQZANPQh14mTH9iEQZoycvCDPC6v5A061xwJ4/37BOW57DmOq5yHs5ch2v1OgvCk9RXCmpMiemFFDADsGfIdRiu8IgSzsOofsDxuKRWjV/pIRg8wVY9Q31cQmGplrO0Qfy8U9yKLW3bfty7+Z4Q+2Aq4jLqBKDnLecKFEU5Xdb+eRhUG+6RQ+0InK/weuY7IUj021+mvR4Eer8NA14I9S0zLegpv3zJij5IEaQbs5/Y3wNfMdyXsv87tBH0tp8lMEiUSZ5Yedyx8BqVGOVPVbpAmk/Li6Rdo+rz8J7FH+hV5kBsk+mAYa8nQFhU0Q+wIAwwkZ8407wkvNY/jbgJ8k0bWu/BJDYXnFma5nZqxpKuk1QRA9JtEoLSyc7tXW8oHQPjhEz/J7kYf2zvKExz81Q2zd3O2ZYK2Hr6YnYmU5cfpvf5YcDXjZN7ZeFaYUkDmvgqLqPVr4lU7SpY/Liov/TJI2nf+w5/oruNJeOur4wP8t8/PvaV3/wRimHAYhyS0JLxYND+a7HhymuF3fBUTajgnd6N7osxuFTd+11azjq/832RL7Ex3Dbo/UfINIDxHmLz6IQj+XCSKpJExgY41xxw7k5zuBc43/ndwSx574uRW4Xvq9iJb2XsWPV1wf826ZnlKuqu0PrX79w2TOzm3tOARvQSqnr+Mb/JDAZV6hINNNMpPzzb4zgjzJQ9mSbkboDQAP02HCZc3WXBB2fkhmtZP80304O1oAzcWd/9YcNJ60jWXc3sIp+QveyuDfanYo6sGSUTGb3ySQKDGBJAtKFqD81Kpyv94P2l+nr0iJaHyP64fO9iZPcFwPvPpFB+8UmGify4qFpnmmYTYXDLQ+Ny1MyGbDqWlaDCCapoZ3fLLVh8fuatFeob+l2+4HIxnXRA/I1Fpwc5qGxl0URBf3lJ9zB362/rllde7TLZtU6fMzSLA1zK5ryD2dgAk7A5CidZzNwznElkTL6NH+3W1CsjFxA7GL4uITiVhYBIKKLj2yxsmRymsUSTOoE5676fappKdceenlFO9mKw75ada8EhdqLaIcQXA2q+sTKE7HU5erGJreDC6zM+mbv9VE7Xg6jAqb8s1rUIaJGWgkRzHMbMbpQ/w9MR4cJzwTiJXBJ0YhJlhFJaF/ZNBSx0B8QwM4KGUBISX3xerPjegD6O5ORCQbY+ieBLNTzwY8p6xR0NfDWtaMsEUl2yTzKe8NNnRTf7PuFXO7lJ3h+nY4Jzo86ryJk+dvX3+tU+UuKDJIMvoVcvsodSCr8kTPJ+46BX1RAXMXAkprnBSAzOcoYhOWOjeDjFAUIqADQ2vNcdtnugCnEKO/2XOy7BDasoPFmbghgAiD6SATfE7qIiUXk3OFaPbJ2EJg04JcC5yEJM5nAxyK4k6PQ8lmGSGhcamRfkSkj+bgpLIAEIRm9lOWXIqk4aby5BtFtwba1/grbK0o7Hb5IP0YbIhj9b8+FPuRutboA55ndTOY+8K1ZYQ67ZDMpS/+2yFP6CyS/EIemGjY3QTrxfSqsRPKhguJ91Ti+XUuhZvWLLL/3Evlmsh/LcZGA9oJbceZ3f2z+ffrta7IuodLPbi1OsnbvkMpResT85WB2zZQ9vEOzeMyhoAObkV8R2/fqII5u9LqPrldNv3ksZSdDidk1eYg4J8weG5OmF3g9mwR8P3sndX1gTztHc2qMnAaiPXUPrg6lZvkDVnoXaeX8WKMnxwNzdJd1ZoFY3CFtIezsOPj8HQWeOQtiZ3ALWn+NDpV/02+khsWtguoZMFtbyBIvUSbM7KlgIcEI/j001bQpmCQ3qDJYTfMTUU9B/TxWx35JWQkH8Kcnz4tXW/Nn56EiU0VOzK2B4UgXDAnM6l5ZaubUpu+RPxsKnT32eOqg1wkQsxGrmW7ga3zHQEp8drNEtrIMZFcpJVOLoqsoOl+AVRU6jHUqIDy7QbbxkYZjvuciLyA8DcDvy9cQ36ax6zITKG654ZUWVyUoQK/qYEyu3g/CC8m52OMtB69UPisD0Lz9P3sMbBiWK4Kf6g9AC3QX994nMFXOiB/sKIz74VPkxwno6GqTF8CSUxz/eph7WIT/8P3hV5oNR","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"随写","date":"2017-04-07T10:20:20.000Z","path":"2017/04/07/2017年4月7日18-20-16/","text":"偶然于网上看到的鲁迅先生的杂文集，《热风》，转载于此。 随感录四十一 ① 从一封匿名信里看见一句话，是“数麻石片”（原注江苏方言），大约是没有本领便不必提倡改革，不如去数石片的好的意思。因此又记起了本志通信栏内所载四川方言的“洗煤炭”②。想来别省方言中，相类的话还多；守着这专劝人自暴自弃的格言的人，也怕并不少。 凡中国人说一句话，做一件事，倘与传来的积习有若干抵触，须一个斤斗便告成功，才有立足的处所；而且被恭维得烙铁一般热。否则免不了标新立异的罪名，不许说话；或者竟成了大逆不道，为天地所不容。这一种人，从前本可以夷到九族③，连累邻居；现在却不过是几封匿名信罢了。但意志略略薄弱的人便不免因此萎缩，不知不觉的也入了“数麻石片”党。 所以现在的中国，社会上毫无改革，学术上没有发明，美术上也没有创作；至于多人继续的研究，前仆后继的探险，那更不必提了。国人的事业，大抵是专谋时式的成功的经营，以及对于一切的冷笑。 但冷笑的人，虽然反对改革，却又未必有保守的能力：即如文字一面，白话固然看不上眼，古文也不甚提得起笔。照他的学说，本该去“数麻石片”了；他却又不然，只是莫名其妙的冷笑。 中国的人，大抵在如此空气里成功，在如此空气里萎缩腐败，以至老死。 我想，人猿同源的学说，大约可以毫无疑义了。但我不懂，何以从前的古猴子，不都努力变人，却到现在还留着子孙，变把戏给人看。还是那时竟没有一匹想站起来学说人话呢？还是虽然有了几匹，却终被猴子社会攻击他标新立异，都咬死了；所以终于不能进化呢？ 尼采④式的超人，虽然太觉渺茫，但就世界现有人种的事实看来，却可以确信将来总有尤为高尚尤近圆满的人类出现。到那时候，类人猿上面，怕要添出“类猿人”这一个名词。 所以我时常害怕，愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光，就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。 此后如竟没有炬火：我便是唯一的光。倘若有了炬火，出了太阳，我们自然心悦诚服的消失，不但毫无不平，而且还要随喜⑤赞美这炬火或太阳；因为他照了人类，连我都在内。 我又愿中国青年都只是向上走，不必理会这冷笑和暗箭。尼采说： “真的，人是一个浊流。应该是海了，能容这浊流使他干净。 “咄，我教你们超人：这便是海，在他这里，能容下你们的大侮蔑。”（《札拉图如是说》的《序言》第三节） 纵令不过一洼浅水，也可以学学大海；横竖都是水，可以相通。几粒石子，任他们暗地里掷来；几滴秽水，任他们从背后泼来就是了。 这还算不到“大侮蔑”──因为大侮蔑也须有胆力。 【注释】 ① 本篇最初发表于一九一九年一月十五日《新青年》第六卷第一号，署名唐俟。 ② “洗煤炭”：见《新青年》第五卷第二号（一九一八年八月十五日）《通信》栏载任鸿隽给胡适的信：“《新青年》一面讲改良文学，一面讲废灭汉文，是否自相矛盾？既要废灭不用，又用力去改良不用的物件。我们四川有句俗语说：“你要没有事做，不如洗煤炭去罢。” ③ 九族：指自身及自身以上的父、祖、曾祖、高祖和以下的子、孙、曾孙、玄孙。另一种说法是以父族四代、母族三代、妻族二代为九族。 ④ 尼采（F.Nietzsche）：参看本卷第59页注〔26〕。下文所说的《札拉图如是说》，即《札拉图斯特拉如是说》，是他的一部主要哲学著作。 ⑤ 随喜：佛家语，《修忏要旨》说：“随他修善，喜他得成。”意思是随着别人做善事，为别人获得善果而高兴。","tags":[{"name":"转载","slug":"转载","permalink":"http://yoursite.com/tags/转载/"}]},{"title":"随写","date":"2017-04-06T16:34:22.000Z","path":"2017/04/07/2017-04-07-00-34-15/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX18zhFSdUcPxmJS7UFjp6aYRFKKKa8Cw8NgVAsmguWsQGhVvYNEheqQ4Shd4ckO1fTheUNKOh9tXaCxHCY15+2x3xgsUnXiQrQGn5wS3NbNi3dE9MbtQ5aEL1cw/I058UL96pEmdk2bh9OwyGQKLYdcYLmXx3xaCXwWZOFrA2mUOmwCgJ8w9Ssr3AG9TDnsEzBy6R8ALAjQm5x1oWkVbwFpbh8sSxoLtOn4Hdd1MIwjaprgjO3LBvLqvew4xo1uxGfrEZtYll2N1xpf3H4q4GGyiZK1nf1gocxMGJe3YT29b/F9cOz0XImry/+x0Q6tLvfINVXGaZ2OKbGAkIGfzXtKh6HbskEb7JpZ/XSPTWtqRGaeapqcRF7Ck+bzG7y4h947pCSi7K3pLuugrfrTftj13dQORJeIoZ98QJAq9WV9CBjVXBMtYFIFGYdRxX2EAJA2O9SEZAC7LjQcrbengjOuXXx6h9QgbCQhB8IlSlfmIKpnv02YwU7pL07uhU6sjbF9dY065YfQaT+cbr6lIowKC66yA8WwcWv/+sG7ODSP2tT+GIMsz4o+CwfE+l+xCEv/RvM83xWNMztqNWlSB1IKpkfbacgSdmv6FHhMgQgz29C0Nrnt/igas0HwKapysiQub7hVSt93v8S72CrQbyJNZPRSb02szU8ygt+FWfVaDXtuLjkJ5ZbYPaIMnLGS0kbHsuzWR8Ot+Z9b3KcxRZQw2AZ8dFBG6+p2kVNUba4IeroprBiH9nbTphjrnRc/xIh0HeJ2wePASFwRioXgwnxzEk9Ov8qjDWR1aQ6ZtSZHyM8eJnY7avE26sfW2p3bmCBPfVaA9H50L5opH7NMY8d4rf1Vn2w9xxNeCYkU+kkwKpW+kBzL6ZwKFS5FJ47USC+EQMtGBSt33cELFr1Zu1MkVsUgiSr8MJQnExeOYEPiufulBO/v2jCYUwdv6eq/BDZy2P0U6/qA1rWIAw6kBrq5peuY8nCHjaUTiUbmbKl+un57HgMkODoUFRYUbIt1qxPFjOAZNjZN94zruKGWA/+ZVuB4GNqZXqsmIX82ZrYZLXq8OUeey7Nkuhnzs0DcTCXK4qCIUM4cHj6muZe3NKQEAHVoYr8uvD/x1dq+00VPAUxeZ32gJLPSfNdf4CDHRtgNYkOEiis8aMkaEFN9peZjOn6p+otMTLum9+wKFVgw9aU+4CTXi34StQUzL8cXWawswu/5OZaPqHPL9WvM5jr8Udqsmb39BuuypCO1f32Yp5JYPEJui9+Vd5/W+oIZ9HByZZOkZE1TZEgtehfX5JmH9BUjnwKDCpl99cysTW7FLSDWvFCBUWeKP40JjnimdRtcWqVhOZCz5Q21FwggJzcCNSY0YCX5Soz6KJePnN/X7pMULR11BqXH79Z5HQxrbUTNvITPq3MWu+k7Gp8Tzv+2BtInHzXyKpP6L8g5RmtZF5E4/iAMHLUoP3KQwwwKfQEAMfP9RWTTdSMfZ2Z/qokUnfTkIB6vw2Dxall2YXvDc4SlMBSZHFPKSyQ/c8eCoZ6OuQQDZhdJgNddc7B77VGQJHFqPKk2nFrpOYXLLg3CrdkeOg1+qZIDbSJH+sSvOrQwyZaXhePwcDdbbEHb8w2WowAzqHhBbZS5dLucZEo+QZy+kBcMKgPHxVfH+cwFfBOzkmoVOYZBEhyy9RMwlbx96QUJPAE7Jd7CX+xy4U+P+rqY/jg6DqeLK1M0OhqE0NEnx0eMzh62oLCKFeib9F+ssbxdLvWG35KS8UJhNqXKyFoWH2n+za2iWTa8EBTITiUNa5x8qLtP9eg5mir01Ogse24GgVbdRxFCi8PXKTiQLwF+J3FVjmCucvKcdj6d9kFgDN9KwBuExDd9R95x7AIlUVCKlxUVOgsPUvmiA6uGzsYj5P1+2QHw1XiKfjHGH6Kw4d1SwDmHI8/jxO+gMmgt9DuN7DBq4wdIVrIYbjcclS4lkciKONcog9LNIN5Qw/6UpZ7cre6AbbAnliqGmj4OhmYCnzuI4hn3hhjdyDOxklECFKr2Niw7bza7ZF2qXuiZ454Mfhq0MT/tl0DnKXUp2YiZc211lKGIt943WphsxfWvpHHXCWx3boGY1UydI1Mz2RdwBuRloqMQ1htAC8+cyH2Hk1dqxp78l8BgAd9gQKakDL/is7bkUlnwaXRqKNbHZaD96dtMumqx53GFDCNUdNKl17oEON4qPgXs4GyOElBrYaf/te8IbBub/Sl1eOeN/rb0plUyMn65jk13sXBnHqB/Bmy4k2dVo/+BTxva5DyDylDK4p1W8cViHIaHPLeNNPmNqC43OHCNxsvilZwnYGpqhSH5dmbRkFPCwFHr3Jyftp/UzC73XICXhuqOTPf/3bcKi7IkVIHtQYJVXLlNojeMDVvn0t3BxN9CG8SxRL6GquqYdUWMzRIUaKdsBK2TCjvYhivsBTQ1kJQjNJqbOiW1HWh72veSCipGCUMJCp157RJG46oyf19ND0wEoILla0syNk9vsBZ+gzKMCJuXFooZ/dGXBqJXFfS1aKTxWc9fEylU9b39T5U7PhO2c6F1xGv3B+DSWwUqItfhaU2DRt9RoR6a3IqYu3Pt3fWVgzaX/u78kfNC9zJoowrGIxoZAZIz7I7fc0qB0xX3+0rMr1V43c08pjnr+JqzkLcVDjrgSg0HQeo6t4gJmmAIDCHUCTroQMM9Odyv4S/YaHakwr0CFlTpti2l+isjWnYaEWWezUoP2KwaN1m/RzL/CuobUMjcswPlb1q2MghTDiuhZXbQN4/fNviosDg5I2dqTjFnqxrWwI7l9vK8CAIT+PakyOL/gwqWp6lX4slG8Tq32Zhc+ULKqwmr77aPrwHEKJccakxKWrzhHQY7Z19YvL9/tVsHovneCwJrBSRR8w6+7LyhjuL6Z2XDNxedJjEvYpDqzzcBy7e1S/Sk7N/UGHFAtqowetWmYDgOJbUeMVObk+I+d9ZfXQ0PWkRthz7TjyYvH/JS1XO67KXo5ebwP3V0LJ3vbciUGTX5tydhnPfDSC6uq+zRriGIX0FNXAYhnHzMav1WNRVPbw/0M1i6SVMsAbb675OM7VmFG7DwIgZvHj9sMZbTft3GFB7CQdEdHlXaIb7EeHqaX0gFCWhoN4mHAW71/IxHvyl5Zju2c2q9HJbqm0CmdwKgYZ9Jqn17GIuSl+XqYyEiOMWGAVWnFywTaIu2EOBfwptwpVtzhouJ+g6yH8QPX/W16y4mJap2+haNJtRIIsuCsZga8178B2NhIX4wQt6aPQmYgy0FhWi0OXyGSzxSLI1BxwtvcPFF3nDISzGwyZ/NxyW3AxK5H48mnugtbr67tqbjT0CLxz8pAQmwG/JBVJrDCeinUFE8kVWBtck9UYVhMel/rO7P9luck89Qkn4tyRXLiwoTZSgUGSRy71LVfWZn4+2AbOt1g0rulOsFSDbyO6l4lmKGLs7RwcSyEkTMcdcZyVvRiI1y2yxYBacIOzSM=","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"随写","date":"2017-04-06T15:47:09.000Z","path":"2017/04/06/2017年4月6日23-47-01/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX19XcpaqK20hrdwGYIl+1eWMHV2UtzzY7EI7qcRB+KHpGey8l0nUrYr9uve9O3jk8IFonZKRtHrQVjcQIaFWUmOB89nc/1tfXo3dHzsJMO5qB7FNpYM3Rp4Jx/h2dZSCXU9tQ9Q7HLzN6XDheK3OG0mkhu2nUL4XIF8ld41U1Eff3KJY1QM2WVyKtjrPl1mFV1sXcWSuWou0T3KCX+qx/AYW1DjtJ79FYIzn77fVHhQfN7IyI7Rz+tZxuovN3zgGFFeZL0rPKvvLO8kydUNypE0BZP1E7MUabBm6RWV6e6vCs/dXL6E3J07Gw/7FtDTaNoaf/MDK/yGgKiOo9jUOpBcs4iZrulXjQxKDTUtmRtkzik6vc9c6iM1LYIQ2+ABG8oh1UqlgAUKP9VbXPx8FKEYFpTHX+Y+IkZk5kQDIkHAom6cNlCAUoh8oPtTWns+GxB5H1sNFYfV++lYfd7xf6BmjgZTsO0t/4UFqH/HM+6stg8QAzfMztNmQ6es6DmtYnXYfFxq46rLJljwJ6Nce0lKL3HYUEGsIKZgIfDZbvBJakKIb4WBjF3rq0q9w46yZB4VsKIgchXHgs6ZKXxekANOY5z7ORnXllv9Z7gi/B6/INNreRNIk7H1StCQe7ehe1mR/7qIm99Wl/wFRotglVtd6IFC/UWc6W+Nzy5B08et/1dscgdw+N2y8vfr/ZFLpdiEbPvdkMWHBJz7x8uOSpZe3Ld3Bjncbf+E+cJyVox7wOupMSDoHIftSIaI7Y8LDzsrAJfVSlHfBYOg15jl+X5BafFK9lC9xvkqAmd3g5W9mmIoOV3D2OY5JkqiWoEMtcc4wMz95Ioga3qC2P09GD5tlBbdWLLlaqw8WtMVbTWo+B8WtzEaTMe91cY/X2U/+CviBTbsk25eaB54Y21fYn9tsVmyS2aulpTExODq4Dxqf+IsnEZ8cgOQbGxWtZxh83qpRJNxIEsBNwuFGZmvtN6G/JjScNeGcahfyW6rN+S+vf9y+X51IaUyJNBrpwu3QrPdTR9WSe9UAUaEESdcwSPJ1PzsUqq89Aer52EcLOcOPL7vyhvxPMqGSb9vOVzSVvNrI215CldBdQ7jaKYJrvBZtA6t/xmcnSdmFvDqVuCPSIBjLTtAHwGSiX87+EKy6Hx8xD6jcIppWWFMauvLkujyRSHyTZu1vaZgQKHwW6tUBoANa4nu3P4t8HA7WQyAooPYfaTIwcs4jJ9Fdb26SMeu0nQkDyknJdtkWapgWkdmHKx2o8gfjDHkyr1WwNzpL5E630dmHQ0waTmU1K7JPZQhyumCFxEogJdtbM7tn/fJlihEUWgK04gx2oe0Ob7YCHXm4oOQ2I8k9OgKtmwQ/5v0xCgQ2YYEj27UNLQcbp+BnHwLhujzREdJiSdR1RT4c1MLlua6jq8QfMrJFju3pt7Jg4SB2UHgmiATNTEjBAC/k6AtTdBLYBdqDOwT77gqqNUmhrVT5wrx6s5Nz74ESsVkehI23yQTShvCIcymG4L2hxokSnkaH/jb1kPJJwv0yYCZ05j2fcckMd097D8oJw4eKgw6p1sdBKchZJfNS2OBOy9JtiqXdZ+z9Uhf+NIMyqawQYSPSRnBkC4tUuuW6S8kIqzXvbVY8jxl6k1wtlGNP4T3cd8KNm/shTDc0oePeTWz8qFIp7p8G9msG+qF+tYGuaWig+oihIJ3jP+beefgq2VrBSRU2OBwqAApDV43N3BXTgg32yP4WQ1c0NUvRlgvAYSVFaXsomut0+qQiqXoNdNUENbDZGmQN3f0x22ehXijyymJ8ibnMhlNwwtHP/0apBd8RXI5uinmKLielDs4xBHyiaKMh5YcvrkjXvuoY4ocgGmNJKn8Vw909QW4TLoVBioSgQVrjb5qlbjtBlMD6VI9LpuifMxSRNuFq1T2TxPrSEA7DXRdKG03zKkrG27GPEhO8ntlK2z6A3l6gEKdazHY7BGe8AAp+xp1vBKnVO9TesHo/pGys5pHhfXd/xiVm94XDyLK4yCbgGBP+1mm6ogxpUOI9m2IjVJ8JaEbJbxqjXyYMQw6r4azSCawJ1mHjNnoJABLbKAP9W2zZmsFhYjGu8c7LlhOZJ0fr96j8Qrd4pgDjg7jLKCdObuAnLEB3jEltqzAq6EZkbeNpKES4nfiXi5/MNS5ANZMvFrqrUlVDDwWeqP/rvmXM31XC83Q6YosttGUWf6Q5NlB+9wYpXorlBfHl4ArBroQP4iFfiuOarr1pqhXRh4JWIdVhdBZ5Y/vuzkVy626ColO1NP2UPu4XpVd+L17cz+lY764U0UNeIAD0eWIxbmwqq10UgE81WkEJ0JFubm2Kdde8HfwCZzc8SZSv1GqUvJ3oMTAXhyt5sVsa0FCEdmelejdbidVV8v0ZMCCDSGYjGyMDF4JdJMqR6v97VcqaDZVDZneGGspAcDFghDNNzRluv82/o5gytemeosbfObfNVGAd3RJaeCveiKglHE/j5c0Ajc5oymOVp0oAuKdvg1R2hRj5W1/yup1BZhaLC0kCVvK7Vf4CpTeE/oXXzysy7n8r+OiEnuUQd8eVbDO6EMaCcuKGzfZ4wycynx5kO16iTuNioZJTLH3ICfWNlH1AxQ1TV79KPXbUFO3AAKmaDddm7gyqoyrp5rg2ZSXnNSqwkAav2nNaSLCD23WT4yuRiSX/Yxm5e3flbLOrh1TIA1Dtfd6qBHVK6EU0Y6GZLuTAgvbSO3yS7xZ8AJMQx8iJzvdZ/Yf3zAhxsKZE0hQmH1DMK9BLN/7UrpEAUvJpaVJI4YD4xingZIlj0SQsq+ifSV/Wq+l9FiKPo5iHtpokIUED8Mn4i1WQ3bO+6qpWNALptqL/A3P8XlkQrfEQQynzu1D+uYH7JSfuKLHip9ZyiMXa54nyIf9hEpN4bRX/fpRGgbFRRHA1E0TkWVp5g8UX8fU5fnQLvg0BDjPDtHrIBAKLlisARH2U/BOTvri7+rsK4zpu/E4Sx4fjl07/I6Vem6i1oElEtCLhjyB35NV6hQSmRWaBL98n/bzRy6bY5SJTLwF6qbJ5bWvJtK3RAhbGKkXtPyw2Bu/9M2CO82MZp14alVA7xq7SERjUlTQAOASx4TzSWQLGfkic8K9qBjWKso4MwoNCnPTYZphdQ0edMtBB7W9pTB8fOA7qUTC/PKOvVkarAW52tFwPBzJi9aDq4toOeDrIyFXXeHA76eqXUUz/APDtk7NGyptUyW6xYxpYyf1b5fVnY+Ti1QMrNBg2WLkbSHDV8hrJrdmcmx8pHdZpvQl9u9hRBJsJbBCfJIlnoHiv6T255gKfoSqaZNqFnLbmbjrx8vv1BgZ3eTNIRD2lGNiddjyjYwQ/ZdGElLJw4Sc+naV4UaDLa8HaVgOIcD3Eq1c2CkFlJFgVLztvHOSm3kM5ZSEW07z3YkQCJ2oXIkRQkCEUT7fk+snqyA0woDuQbI3NW4/sRlYPYwoyvF2o1cPd+W+cEi+CmaUUKp1tgntB0M4zzMH4imzyeKuXaP2aQXQjsPFip4HVBwOi6m+LbWqtgyN3BmkA2JU1wOa+fw+z6ttAaMNkyYYJ5OwjntXxwW5IVkIAIg3RBS/MiHhT/TPdbtgC5SEelyXg0c0k3ZF5BoLYpKmXNbRWFUDi7RWoKeS/+gc3iNrVsVGlgafgTU31za17VuipAD9NxJPHpLYZ9G5HjYPtjtkbiQfsh+0vwKqqlKg0p5Q58RCf9djiIi/4u0NFpLa1J4upKrzxHOZZK2Dt3hTTA+C+p3qZtnQEr/edXQ7NzQ7/KPXNzxZCbNDMDufk00NJxKAqz2Werprv/WdEfAG/HqbSyhZGGHvnqSie2oT3jX3NyWUB4FMxaSaTObv0jiBSLpqyl+GYtJqtj8zBItU3vgjNDScxJ6njbuQwvL2VFe8eh5e02ryqLEpBbd0/e3gVlKjkdkMbgCvYvLrDH2BcSaobhHzenYCoKgfPEme1ZLA0fhSabhEqoSovJXfjs9qmt37iRb5dV7G4OvaYzNEKzVDLE8H6700gmE4i0DihsW9vERrlV3sLxuC5pi1UI62lINV8tAfdn6qF5GqwMNsPkw82Ml+MyK6k0YCJI05tiaN3vxASXnnqoFfG2Hgl7A/eW+N6UI1jDHZVKdTMwM8dqvBABwTy1yUaVbo33sSR8YsXE5C4fks4qVUI83O2CI5Y7L4zK0C8G55o7kFXoDtOfsGYjYvrhsZDRJlhKf+l5TJkkISJq/rqsVXOxMsrm0GX7obAIYzCsUEVNHSOMLPedzNQduRPBchuuTSM+P5xRnJimY4ShnEc/FiRR92cmqOpO706xiG8jU7fA02orzaerylGb1ujiK+U0+ShqWJ2F5eKtu6yuKTTvyLjqM92eW1VMwoTAwIIImFE7zeu7b26Wp3/n4626BHnw5zlNt7uMjyC6LkEnrUkfMEamdsS+zQfgZHE4i1D22DlJL1tpTeFlwFSePcPXO/8bZzT4OYjx0+mx9AFqI+dly471NLFskwT0rhOpTvd24nPjepdtVB3DjdfjcSzmZRkFPDrqbAvwhR2LgcjP2/K+7f6wOI2+VEq72mZIi+kxYLbbnGSlSoADggKLailzvgKkludx7AWrpLRqIZfECNojij2TGC4ckKTXOr4xe0MbdjMuOC/PqDU9vNl3+5bnY19RVHFlFafdBZmIjfz/Etfii2bIxF+lqJ2jjgGuWQc32MjbmEqAlxZyInPIllqVafQpwBHK68UkDNlZBZhjWokZwyiadeeUKpKCweSheRzbTReqYE27ES90NiYBhlnyCYqeKkC7VQkkL5oZpRLJo5OgQbG/3jjPKnexjW18VcKsD/OSN7lqvH/UVKRQvZ/5x6WHgIo1FsBWNY2QXM41EdFuCliEbbvUeUmKaInp4M6/9Vs1O/qEFhsVbGU8vuQ","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"拷贝、赋值、析构","date":"2017-04-06T12:36:00.000Z","path":"2017/04/06/拷贝/","text":"拷贝构造函数定义如果一个构造函数的第一个参数是自身类类型的引用，且任何额外参数都有默认值，则此构造函数是拷贝构造函数。拷贝构造函数的第一个参数必须是一个引用类型，且几乎总是一个const的引用。 如果类没有显式地定义一个拷贝构造函数，那么编译器会为其合成一个拷贝构造函数 合成拷贝构造函数合成的拷贝构造函数会将其参数的成员逐个拷贝到正在创建的对象中。编译器从给定对象中依次将每个非static成员拷贝到正在创建的对象中。 成员的类型决定了如何拷贝：对于类类型的成员，会使用拷贝构造函数来拷贝；内置类型的成员则直接拷贝；数组类型则会逐元素地拷贝。 拷贝初始化(拷贝构造函数使用的时候)： 用 = 号定义变量 将一个对象作为实参传递给一个非引用类型的形参 从一个返回类型为非引用的函数返回一个对象 用花括号列表初始化一个数组中的元素或一个聚合类中的成员 拷贝构造函数被用来初始化非引用类类型参数，如果拷贝构造函数的参数不是引用类型，则调用永远也不会成功——为了调用拷贝构造函数，我们必须拷贝它的实参，但为了拷贝实参，我们又需要调用拷贝构造函数，如此无限循环 拷贝赋值运算符定义赋值运算符是一个名为operator= 的函数。类似于其他函数，运算符函数也有一个返回类型和一个参数列表。重载赋值运算符，必须定义为成员函数，如此才可以将this参数隐式地绑定到左侧运算对象上，而右侧运算对象作为显式参数传递。拷贝赋值运算符接受一个与其所在类相同类型的参数。且为了与内置类型的赋值保持一致，赋值运算符通常返回一个指向其左侧运算对象的引用。如果类没有定义赋值运算符重载函数，那么编译器会为其合成一个。 合成赋值运算符与拷贝构造函数类似，会将右侧运算对象的每个非static成员赋予左侧运算对象的对应成员，通过成员类型的拷贝赋值运算符来完成的。同样，对于数组，逐个赋值数组元素。 编写赋值运算符需注意 如果将一个对象赋予它自身，赋值运算符必须能正确工作 大多数赋值运算符组合了析构函数和拷贝构造函数的工作(先析构左侧运算对象，再将右侧运算对象拷贝给左侧运算对象) 析构函数定义及作用析构函数执行与构造函数相反的操作：构造函数初始化对象的非static数据成员；析构函数释放对象使用的资源，并销毁对象的非static数据成员。 析构函数是类的一个成员函数，名字由波浪号接类名构成，没有返回值，也不接受参数，因此，不能被重载，一个给定的类只有一个析构函数。 在一个析构函数中，首先执行函数体，然后销毁成员，析构函数函数体并不销毁成员，成员是在析构函数体之后隐含的析构阶段中被销毁的。成员按照初始化顺序的逆序销毁。 通常，析构函数释放对象在生存期分配的所有资源。成员销毁时发生什么完全以来于成员的类型。类类型的成员需要执行成员自己的析构函数，内置类型则不需要进行任何操作。 隐式销毁一个内置指针类型的成员不会delete它所指向的对象，智能指针属于类类型，所以具有析构函数，在在析构阶段会被自动销毁，同时释放指向的内容 调用时间无论何时一个对象被销毁，就会自动调用其析构函数 变量在离开其作用域时被销毁 当一个对象被销毁时，其成员被销毁 容器被销毁时，其元素被销毁 对于动态分配的对象，当对指向它的指针应用delete运算符时被销毁 对于临时对象，当创建它的完整表达式结束时被销毁","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"类的构造函数","date":"2017-04-04T02:30:30.000Z","path":"2017/04/04/类的构造函数/","text":"什么是构造函数(constructor)每个类都分别定义了它的对象被初始化的方式，类通过一个或几个特殊的成员函数老控制其对象的初始化过程，这些函数叫做构造函数。 构造函数的特点 构造函数的名字和类的名字相同 构造函数没有返回值 一个类可以包括多个构造函数，不同的构造函数之间必须在参数数量或参数类型上有所区别 构造函数不能被声明为const的 对于创建一个const对象，直到构造函数完成初始化的过程，对象才真正取得其常量属性。 类的常量数据成员的在构造函数中初始化使用初始值列表初始化(在函数体中是对常量成员的赋值，不是初始化，因此会导致错误)的方法 同理，引用类的数据成员也必须初始化，规则同上。 使用初始化列表初始化成员时，初始化的顺序与它们在类定义中的出现顺序一致，构造函数初始值列表中初始值的顺序的前后位置关系不会影响实际的初始化顺序。数据成员的初始化在函数体开始前就已完成 建议使用构造函数初始值：在很多类中，初始化和赋值的区别事关底层效率的问题：前者直接初始化数据成员，后者先初始化再赋值；再者，一些数据成员必须被初始化，如const、引用、未提供默认构造函数的类 默认构造函数定义如果我们的类没有显示地定义任何构造函数，那么编译器会为我们隐式地定义一个默认构造函数。 编译器创建地默认构造函数又称为合成地默认构造函数。初始化规则如下： 如果存在类内地初始值，用其来初始化成员：C++11规定，可以为数据成员提供一个类内初始值，创建对象时可以用于初始化数据成员。类内初始化就是在定义成员变量的同时将其初始化。 否则，默认初始化该成员：内置类型的变量未被显式初始化，值由定义的位置决定，定义于任何函数体之外的变量被初始化为0；定义于函数体内部的内置类型变量(局部变量，包括类中的成员变量)将不被初始化。 =default的含义在C++11中，如果我们需要默认的行为，那么可以通过在参数列表后面写上 =default 来要求编译器生成构造函数。=default 既可以和声明一起出现在类的内部，也可以作为定义出现在类的外部。和其他函数一样，如果=default出现在类的内部，则默认构造函数是内联的。如果在类的外部，则默认情况下不是内联的。 默认初始化发生的时间当对象被默认初始化或值初始化时自动执行默认构造函数。默认初始化在以下情况发生： 当我们在块作用域内不适用任何初始值定义一个非静态变量或者数组时 当一个类本身含有类类型的成员且使用合成的默认构造函数时 当类类型的成员没有在构造函数初始值列表中显式地初始化时 值初始化在以下情况发生： 在数组初始化的过程中如果我们提供的初始值数量少于数组的大小时 当我们不使用初始值定义一个局部静态变量时 当我们通过书写形如 T() 的表达式显式地请求值初始化时 委托构造函数(delegating constructor)一个委托构造函数使用它所属类的其他构造函数执行它自己的初始化过程。 一个委托构造函数有一个成员初始值的列表和一个函数体。在委托构造函数中，成员初始值列表只有一个唯一的入口，就是类名本身。与其他成员初始值一样，类名后面紧跟圆括号括起来的参数列表，参数列表必须与类中另外一个构造函数匹配。 12Sales_data(int size, string s) &#123;&#125;Sales_data() : Sales_data(0, \"\") &#123;&#125; //此处就是委托构造函数 当一个构造函数委托给另一个构造函数时，受委托的构造函数的初始值列表和函数体被依次执行。假如函数体包含有代码的话，将先执行这些代码，然后控制权才会交还给委托者的函数体。","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"Process Synchronization(进程同步)","date":"2017-04-04T02:15:58.000Z","path":"2017/04/04/Process Synchronization(进程同步)/","text":"Background 对共享数据的并发请求会导致数据的不一致 维持数据的一致需要一个能确保共享同一逻辑地址的协作进程可以有序地执行 The Critical-Section Problem(临界区问题)何为临界区每个进程有一个代码段称为临界区，在该区中进程可能改变共同变量、更新一个表、写一个文件等。这种系统的重要特征是当一个进程进入临界区，没有其他进程可被允许在临界区内执行，即没有两个进程可同时在临界区内执行。 何为临界区问题临界区问题是设计一个以便进程协作的协议。每个进程必须请求允许进入临界区，实现这一请求的代码段称为进入区(entry section)，临界区之后可有退出区(exit section)，其他代码为剩余区(remainder section)。 如何解决临界区问题 强制实施互斥：在具有关于相同资源或共享对象的临界区的所有过程中，一次只允许一个进程进入临界区； 一个在非临界区的进程必须不干涉其他进程； 不允许一个需要访问临界区的进程被无限延迟； 没有进程在临界区时，任何需要进入临界区的进程必须能够立即进入 相关进程的速度和处理器数目没有任何要求和限制 一个进程阻留在临界区中的时间必须时有限的 有空让进；无空等待；择一而入；算法可行 Peterson‘s Solution 经典的基于软件的临界区问题的解答。 适用于两个进程在临界区与剩余区之间交替执行。 LOAD 和 STORE 指令是原子型(atomic)的指令，即该指令不能被中断，或者说指令要么完全执行，要么完全不执行。 12int turn;boolean flag[2]; Peterson算法适用于两个进程在临界区与剩余区交替执行。 通过证明三个条件成立证明算法可行： 互斥成立 前进要求满足 有限等待要求满足 Synchronization Hardware(硬件同步)Peterson算法是基于软件的临界区问题的解决，同样，也可以通过硬件来实现。 对于单处理器的环境，临界区问题可简单地解决：在修改共享变量时，禁止中断出现。这样，就能确保当前指令序列地执行不会被中断。由于其他指令不可能执行，所以共享变量也就不会被意外修改。 然而，在多处理器地环境下，这种方法因为效率地原因行不通，因此现代计算机系统提供了特殊硬件指令以允许能原子地(不可中断地)检查和修改字的内容或交换两个字的内容。可以使用这些特殊指令来相对简单地解决临界区问题。 指令TestAndSet()的特点是该指令能原子地执行。因此，如果两个指令TestAndSet()同时执行在不同的CPU上，那么它们会按照任意顺序来执行。这样可以实现互斥。 因为在while的判断语句中的TestAndSetLock(&amp;lock)是原子型的指令因此其在执行时不会被中断，也就是在这个指令执行之后，能够获得期待获得的结果，而不会因为该指令在执行的过程中被中断而导致lock的值被改变，从而导致未知的结果 例如：有两个指令TestAndSet()同时执行在不同的CPU上时，那么它们会按照任意顺序来顺序执行。而不会将TestAndSet()指令拆分为更小的指令交替执行。 缺点 对不能进入临界区的进程，采用忙等待，浪费CPU时间。 将测试能否进入临界区的责任推给各个竞争的进程会削弱系统的可靠性，加重了用户编程负担。 Semaphores(信号量)什么是信号量信号量S是个整数变量，除了初始化外，它只能通过两个标准原子操作：wait()和signal()来访问。这些操作被称为P和V操作。 在wait()和signal()操作中，对信号量整型值的修改必须不可分地执行，即当一个进程修改信号量值时，不能有其他进程同时修改同一信号量的值。 为了克服忙等待，可以修改信号量wait()和signal()的定义。当一个进程执行wait()操作时，发现信号量不为正，则它必须等待。这里的等待是阻塞(block)自己。即将一个进程放入到与信号量相关的等待队列中，并将该进程的状态切换为等待状态。然后将控制转到CPU调度程序，以选择另一个进程来执行。(相对于忙等待，这种方法需要消耗部分时间在上下文切换) 一个被阻塞在等待信号量S上的进程，可以在其他进程执行了signal()操作之后被重新执行(通过wakeup()操作来实现)，该操作将进程从等待状态切换到就绪状态然后放入就绪队列。 1234typedef struct &#123; int value; struct process *list;&#125;semaphore; wait()操作的实现： 1234567wait(semaphore *S) &#123; S-&gt;value--; if (S-&gt;value &lt; 0) &#123; add this process to S-&gt;list; block(); &#125;&#125; signal()操作的实现： 1234567signal(semaphore *S) &#123; S-&gt;value++; if (S-&gt;value &lt;= 0) &#123; remove a process P from S-&gt;list; wakeup(P); &#125;&#125; 如果信号量的值为负，那么其绝对值就是等待该信号量的进程的个数。 信号量的关键之处是它们原子地执行。必须确保没有两个进程同时对同一信号量执行操作wait()和signal()。 上述地情况也属于临界区问题，wait和signal方法的原子实现，单处理器环境只需要通过在执行wait()和signal()操作时禁止中断来解决。但是在多处理器环境下，则必须提供其他加锁技术(如自旋锁)，以确保wait()和signal()可原子地执行。 必须承认对于这里的wait()和signal()操作的定义，并没有完全取消忙等待，而是取消了应用程序进入临界区的忙等。而且，将忙等限制在操作wait()和signal()的临界区内，这些区比较短。因此，临界区几乎不被占用，忙等很少发生，且所需时间很短。 Deadlock and Starvation(死锁和饥饿)什么是死锁具有等待队列的信号量的实现可能导致这样的情况：两个或多个进程无限地等待一个事件，而该事件只能由这些等待进程之一来产生。这里的事件是signal()操作的执行。当出现这样的状态，这些进程就称为死锁。 什么是饥饿饥饿也叫做无限期阻塞(indefinite blocking)，即进程在信号量内无限期等待。如果对与信号量相关的链表按LIFO顺序来增加和移动进程，那么可能会发生无限期阻塞 Classic Problems of Synchronization Bounded-Buffer Problem(有限缓冲问题) 三个信号量，分别初始化：full = 0, empty = n, mutex = 1 其中mutex的作用是记录访问这个仓库（缓冲区）的进程的数量。 Readers and Writers Problem(读者写者问题) 有两组并发进程：读者和写者，共享一个文件F，要求： 任意多个读者可以同时读取文件； 一次只有一个进程可以往文件中写； 写进程执行写操作前，禁止任何文件读取文件 读-读允许，读-写互斥，写-写互斥 如果读者到： 无读者、写者，新读者可以读 有写者等，但有其他读者正在读，则新读者也可以读 有写者写，新读者等 如果写者到： 无读者，新写者可以写 有读者，新写者等待 有其他写者，新写者等待 如果读者优先，可能导致写进程长时间等待，出现写进程被饿死；实际的系统是写者优先，即当有进程在读文件时，如果有新进程请求写，那么新的读进程被拒绝。 信号量mutex和wrt初始化为1；readcount初始化为0.信号量wrt供写者作为互斥信号量；信号量mutex用于确保在更新变量readcount时的互斥。变量readcount用来跟踪有多少进程正在读对象。 Dining-Philosophers Problem(哲学家吃饭问题)","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"类的this指针","date":"2017-04-01T14:36:51.264Z","path":"2017/04/01/类的this指针/","text":"定义成员函数通过一个名为this的额外的隐式参数来访问调用它的那个对象。当我们调用一个成员函数时，用请求该函数的对象地址初始化this。在成员函数内部，我们可以直接使用调用该函数的对象的成员，而无须通过成员访问运算符来做到这一点，因为this所指的正是这个对象。任何对类成员的直接访问都被看作this的隐式引用。this形参是隐式定义的。任何自定义名为this的参数或变量的行为都是非法的。因为this总是指向“这个”对象，因此this是一个常量指针，且是一个指向非常量类类型的常量指针 类的const成员函数与this指针类的const成员函数是在紧随参数列表之后加上const关键字，这里，const的作用是修改隐式this指针的类型。默认情况下this是一个常量指针，且是一个指向非常量类类型的常量指针，因此，this指针不能被绑定到一个常量对象上。也就使我们不能在一个常量对象上调用普通的成员函数。一旦将成员函数声明为常量成员函数，那么this是指向常量的常量指针，所以常量成员函数不能改变调用它的对象的内容。 赋值运算符重载返回*this一般来说，当我们定义的函数类似于某个内置运算符时，应该令该函数的行为尽量模仿这个运算符。内置的赋值运算符把它的左侧运算对象当成左值返回，因此为了保持一致，这些定义的函数也必须返回引用类型。 从const成员函数返回*this一个常量成员函数的this指针是一个指向const的指针而*this是const对象。因此，常量成员函数的返回类型应该是const&amp;。即使引用返回的是左值，但是由于const的作用也无法改变返回值的值。","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"Hello World","date":"2017-04-01T14:36:51.248Z","path":"2017/04/01/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"}]},{"title":"","date":"2017-03-31T14:18:29.448Z","path":"2017/03/31/Linux学习/","text":"开机流程与主引导分区(MBR)BIOS是在开机的时候计算机系统会主动执行的第一个程序 BIOS：一个写入到主板上的一个韧体(韧体就是写入到硬件上的一个软件程序) CMOS：记录各项硬件参数且嵌入在主板上的存储器 开机流程如下： 主动执行BIOS，识别第一个可开机的设备(如光盘、硬盘、U盘等) —&gt; MBR，第一个可开机设备的第一个扇区内的 主引导分区块，内包含引导加载程序 —&gt; 引导加载程序(Boot loader)，一支可读取内核文件来执行的软件。—&gt; 内核文件，开始操作系统的功能 Boot loader是操作系统安装在MBR上的一套软件，主要包括 提供菜单：用户可以选择不同的开机选项，是多重引导的重要功能 载入内核文件：直接指向可开机的程序区段来开始操作系统 转交其他loader：将引导加载功能转交给其他loader负责(因为引导加载程序除了可以安装在MBR之外，还可以安装在每个分区的引导扇区(boot sector)) 多重引导的工作： 每个分区都拥有自己的启动扇区 实际可开机的内核文件是放置到各分区内的 loader只会识别自己的系统分区内的可开机内核文件，以及其他的loader而已 loader可直接指向或者是间接将管理权转交给另一个管理程序 Linux安装模式下，磁盘分区的选择目录树结构所谓目录树结构就是以根目录为主，然后向下呈现分支状的目录结构的一种文件结构。 文件系统与目录树的关系(挂载)所谓的挂载就是利用一个目录当成进入点，将磁盘分区的数据放置在该目录下；也就是说，进入该目录就可以读取该分区的意思。这个操作称为挂载，进入点的目录称为“挂载点”。由于整个Linux系统最重要的就是根目录，因此根目录一定需要挂载到某个分区。至于其他的目录则可依用户自己的需求来给予挂载到不同的分区。","tags":[]},{"title":"CPU Scheduling","date":"2017-03-22T01:05:51.000Z","path":"2017/03/22/CPU-Scheduling/","text":"CPU调度是多道程序操作系统的基础。通过在进程之间切换CPU，操作系统可以提高计算机的吞吐率。 Basic ConceptsMaximum CPU utilization obtained with multiprogramming:对于单处理器系统，每次只允许一个进程运行；任何其他进程必须等待，直到CPU空闲能被调度位置。多道程序的目标是在任何时候都有某些进程在运行（通过利用等待某些I/O请求的时间），使CPU使用率最大化。 CPU-I/O区间周期：进程执行由CPU执行和I/O等待周期组成。进程在这两个状态之间切换。进程执行从CPU区间（CPU burst)开始，在这之后是I/O区间（I/O burst），接着是另一个CPU区间，然后是另一个I/O区间，如此进行下去。最终，最后的CPU区间通过系统请求终止执行。 CPU区间时间曲线： 该曲线通常为指数或超指数形式，具有大量短CPU区间和少量长CPU区间。 CPU Scheduler（CPU 调度器）每当CPU空闲时，操作系统就必须从就绪队列中选择一个进程来执行。进程选择由短期调度程序执行。 CPU调度决策发生的时间： 进程从运行到等待的切换 进程从运行到就绪的切换 进程从等待到就绪的切换 进程终止 即CPU中即将没有进程执行，将要空闲的时候 对于第一种和第四种情况，没有选择只有调度。一个新进程(如果存在)必须被执行，此时是从就绪队列中调度出来执行。不过，对于第二种和第三种情况，可以进行选择。 所谓的选择就是选择一个就绪队列中的进程来执行。 当调度只能发生在第一和第四种情况下时，称调度方案是非抢占的(nonpreemptive)的或协作的(cooperative)；否则，称调度方案是抢占的(preemptive)。 非抢占式调度，一旦CPU分配给一个进程，那么该进程会一致使用CPU直到进程终止或切换到等待状态。 抢占调度对于访问共享数据是有代价的。需要同步机制来解决；对于操作系统内核的设计也有影响。 Dispatch(分派器)分派器将CPU的控制权交给短期调度程序选中的进程;包括： 上下文切换 用户模式切换 跳转到用户程序的适当的位置重启程序（中断重新启动） 先在内核模式进行上下文切换 -&gt; 切换到用户模式 -&gt; 到合适的位置重启程序 分派器停止一个进程而启动另一个所要花的时间称为分派延迟(dispatch latency) Scheduling Criteria(调度准则) CPU utilization - keep the CPU as busy as possible Throughput(吞吐量) - of processes that complete their execution per time unit. Turnaround time(轮转时间) - Turnaround time is the sum of the periods spent waiting to get into memory, waiting in the ready queue, executing on the CPU, and doing I/O. Waiting time - amount of time a process has been waiting in the ready queue. Response time - amount of time it takes from when a request was submitted until the first response is produced, not output (for time-sharing environment).Scheduling Algorithms(调度算法) First-Come,First-Served(FCFS)Scheduling:先请求CPU的进程先分配到CPU。可以使用FIFO队列来实现。不过进程等待时间通常较长。可能会出现护航效果(convoy effect)，导致CPU和设备的使用率变得很低 Shortest-Job-First(SJF)Scheduling:将每个进程与其下一个CPU区间段相关联。当CPU空闲时，会将CPU分配给具有最短CPU区间的进程。SJF是理想的情况，因为无法测定每个进程运行所需的CPU时间，但可以作为上限。 Shortest-Remaining-Time-First(SRTF):抢占式的，将CPU分配给当前执行剩余时间最少的进程。 Determining Length of Next CPU Burst:认为下一个CPU区间的长度与之前的相似，通过计算下一个CPU区间长度的近似值，能选择具有最短预测CPU区间的进程来运行。通常可预测为以前CPU区间的测量长度的指数平均。 Priority Scheduling:每个进程都有一个优先级与其关联，具有最高优先级的进程会分配到CPU。具有相同优先级的进程按FCFS顺序调度。优先级算法的一个主要问题是无穷阻塞(indefinite blocking)或饥饿(starvation)。解决方法之一是老化(aging)，即逐渐增加在系统中等待很长时间的进程的优先级。 Round Robin(RR):定义一个较小时间单元(时间片),当时间片走完之后，进程会被抢占同时被加入到就绪队列的末端。如果时间片很大，RR与FCFS类似，如果时间片很小，那么大部分时间浪费在上下文切换。根据经验，80%的CPU区间应该小于时间片，即大部分的进程在一个时间片内可以完成。通常，RR的平均轮转时间高于SJF，但响应时间低于SJF。 Multilevel Queue:将就绪队列分成多个独立队列。根据进程的属性，如内存大小、进程优先级、进程类型，一个进程被永久地分配到一个队列。每个队列有自己的调度算法。进程进入系统后永久地被分配到一个队列。优点是低调度开销，缺点是不够灵活。 Multilevel Feedback Queue:允许进程在队列之间移动。根据不同CPU区间的特点区分进程。如果进程使用过多CPU时间，就被转移到更低优先级队列。在较低优先级队列等待时间过长的进程会被转移到更高优先级队列。这种老化可以阻止饥饿发生。Multiple-Processor Scheduling(多处理器调度)(非重点) Real-TIme Scheduling Hard real-time systems：要求在一定时间内完成某个任务。 Soft real-time computing: 统计意义上的实时，例如，有的应用要求系统在95%的情况下都会确保在规定的时间内完成某个动作，而不一定要求100%。Thread Scheduling Local Scheduling:线程库如何决定哪一个线程分配到哪一个LWP Global Scheduling:内核如何决定哪一个内核线程下一个运行","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"随写","date":"2017-03-16T16:17:44.000Z","path":"2017/03/17/2017年03月17日00-17-41/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX19hr6mor1hEMKPI7fE15ob9PqiO7QVmi05hFYX+LPNW+9YT7cGzi2sekx8D6Aw5sLTb4+5nK4AfGHAC54FpyQYtgoZh6IspHYVk2dt9b2kKidu7iz77gKoxNEySHH5rIjmF3rvBKr6BNbH+OSXdkQiyX8plLM8ZwqgAphe95nuxCXyIB4p9y9kwl2SbU0Bet4T3a3v2rLGda8JSyp4o3oP4uZmQMF6ibj09dayhbJwwgEtrd7GmK1qieTBfGixtdgC4UagMOfU9xosABj4GwKeZESYznBz9A2I4fHWrZdOf5pRY20zz8FyX1yuoxKLpgsgdbMVe7OhGF6wsRryeX++qZmc+Jb+xzjkWRuBk714DDLjnZyi6VxYus9c+3jlHeAIHD3BSAnt2NHe08i/wG+puCkwySMgZ2hUh67ZcPiiXwlYZ1ttBnzge+DBgtfzsBIMFXXcrO0VxD4ATES2YyewODGEuactv/Zwx0h23YFpTv8k2mTQZTkbz4aC5I30X8V8Rckc/43S5h5zNFfiCr/t1vVrT6WYEfKcxGYZpVo5JOq0fqRSPgSxftEW+albP6v1bblbdjGhvxGx5IvQa7YnorPlPcz6IZilc9Sn3uhbF6K+Z7Nn5I2Q/RNciPThLBtPi9qt5ChJHiO58nhAin1VH4rfTHtLDf4abok3rJnVpsGlCeBXKrKCHxQo2PMhQ4gr7OAcW5ZF3t1HW+9CVC5bi6ILe54lHpkROUtWdxLa9AvfL+hraXddJakSP0E7HsEEVpCzEeV5r/tTjxBB6+X94UhoZFEVmwcKN2EEV3JAgIE6c2lmicT0L4v/VXFqbmJY1BDXg5bsfXWB8EJxbfNym80iUkC5QtDwbdLtCdv6eao5noH/fvaX3+kR4d04WMsWKUhkU0Oovmb7p+Hxn2VYn5FB/93PCgu93tcOnsAxZ29UqXWt3KvW0L6B4P3kLswIVE+yLOpm3UvFPAUY1JszAjcJ5rIHsrZnBvqAI9nB1xvhNczCL5S+OhJwxgv+Tf1Sbe3kyx9gtTtC/AwdV+wUN7iVFa9zu7ZTRQzPwB98UfgHkvV2nlxMMW04PYpIWK3P8mGkuBXMHHqt/wn062ul1D+RlpbYAHh5V+i62/5/1uyRqwxm3sb5m5VX9zmHjWg2YstcWBpqzWGY5zdh9wj/CymE1JPzvDf9Rqlcpb+qbcLdbFEQkLPIZ2BntSQv386QD154yToBnahJTMxVq+4bEg5QerQs+aOX1ghW4+dGUabBPLOgsANcnDW0hSgfHYZl/TIfP9618XX21d9OhVKhuVhns6s1iLfPki5O2prksmENuJv4l/j1G02XGw5spiwgmKigDDJQtK06cfnlKellJgkLIuj6ip9q+uGsfJpX6IuyT8VWDtmbNbch5dQH5lsKQcgYlsikmUG/KTLT1NHf47oqAhDPTXj0C0gVO4dCV2k5sv3fWI7FedEBQAJJpZ1qAX8THdnrZykUFc8x4RDr8SvRjjq7AhYRN/a++d9Fd7fmVl+y4vZR9XZ0KYl0iIFGTIImd6uM0ypuUPHJ+v8Z5eSxSN0/BYp7+vNbLoM+S5IufkYpsTPGXNJG3fA41TdLn2sxOlBwBJw==","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"thread","date":"2017-03-15T15:09:33.000Z","path":"2017/03/15/thread/","text":"Concept:线程是CPU使用的基本单元，由线程ID、程序计数器、寄存器集合和栈组成。线程共享代码段、数据段、和其他操作系统资源 Process: Ownership of memory, files, other resources Thread: Unit of execution we use to dispatch 进程是资源的拥有者，线程是程序的执行者 Benefits: Responsiveness(响应度高)：即使部分阻塞或执行较冗长的操作，该程序仍能继续执行 Resource Sharing(资源共享)：线程默认共享它们所属进程的内存和资源 Economy(经济)：进程创建所需要的内存和资源的分配比较昂贵，线程能共享它们所属进程的资源 Utilization of MP Architectures(多处理器体系结构的利用)：不管有多少CPU，单线程进程只能运行在一个CPU上。在多CPU上使用多线程加强了并发功能 Multithreading Models(多线程模型)User and Kernel Threads User Threads: Thread management done by user-level threads library in user space Kernel threads: Threads directly supported by the kernel Many-to-One(多对一模型)多对一模型将许多用户级线程映射到一个内核线程，线程管理是由线程库在用户空间进行的，因此效率比较高。但是如果一个线程执行阻塞了系统调用，那么整个进程会阻塞。而且，任何时候只有一个线程能够访问内核，多个线程不能并行运行在多处理器上。 One-to-One(一对一模型)一对一模型将每个用户线程映射到一个内核线程。当一个线程执行阻塞系统调用时，能允许另一个线程继续执行，也能够并行运行在多处理器系统上。但是每创建一个用户线程就需要创建一个相应的内盒线程，开销大，也就限制了线程数量。 Many-to-Many(多对多模型)多对多模型允许将多个用户线程映射到多个内核线程，同时能够创建足够多的内核线程。 Two-level Model(二级模型) Thread Pools(线程池)线程池的主要思想是在进程开始时创建一定数量的线程，并放到池中等待工作。当服务器收到请求时，它会唤醒池中的一个线程(如果有可用的线程)，并将要处理的请求传递给它。一旦线程完成了服务，它会返回到池中等待工作。如果池中没有可用的线程，那么服务器会一直等待直到有空线程为止。线程池具有如下有点： 通常用现有线程处理请求要比等待创建新的线程快 线程池限制了在任何时候可用线程的数量。这对那些不能支持大量并发线程的系统非常重要 Thread Specific Data(线程特定数据)一个进程的线程共享进程数据，但是，某些情况下每个线程可能需要拥有自己一些数据的副本，这种数据称为线程特定数据，在我们区别一个进程中的某个线程时尤其有效","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"GDB调试","date":"2017-03-15T05:13:25.000Z","path":"2017/03/15/GDB调试/","text":"文中代码部分及部分讲解转载自陈皓gdb教程相关博客 What is GDB? GDB, the GNU Project debugger, allows you to see what is going on `inside’ another program while it executes – or what another program was doing at the moment it crashed.GDB can do four main kinds of things (plus other things in support of these) to help you catch bugs in the act:Start your program, specifying anything that might affect its behavior.Make your program stop on specified conditions.Examine what has happened, when your program has stopped.Change things in your program, so you can experiment with correcting the effects of one bug and go on to learn about another.The program being debugged can be written in Ada, C, C++, Objective-C, Pascal (and many other languages). Those programs might be executing on the same machine as GDB (native) or on another machine (remote). GDB can run on most popular UNIX and Microsoft Windows variants. 简单来说，GDB就是一个DEBUG的工具 GDB 安装Linux系统下：终端运行如下命令1sudo apt-get install gdb Windows系统下：下载MinGw或者TDM-GCC然后配置一下环境变量就可以在CMD中使用了。安装完成后输入：1gdb -v 出现如下提示表示安装成功：1234567891011121314GNU gdb (Debian 7.11.1-2) 7.11.1Copyright (C) 2016 Free Software Foundation, Inc.License GPLv3+: GNU GPL version 3 or later &lt;http://gnu.org/licenses/gpl.html&gt;This is free software: you are free to change and redistribute it.There is NO WARRANTY, to the extent permitted by law. Type \"show copying\"and \"show warranty\" for details.This GDB was configured as \"x86_64-linux-gnu\".Type \"show configuration\" for configuration details.For bug reporting instructions, please see:&lt;http://www.gnu.org/software/gdb/bugs/&gt;.Find the GDB manual and other documentation resources online at:&lt;http://www.gnu.org/software/gdb/documentation/&gt;.For help, type \"help\".Type \"apropos word\" to search for commands related to \"word\". 编译说明要使用gdb调试程序，必须在进行编译时（g++或gcc）加入-g选项进行编译：1g++ test.cpp -g 运行GDBlinux系统下编译链接默认生成a.out文件，所以在a.out文件所在目录下执行：1gdb a.out windows系统下默认生成a.exe，同理在a.exe文件所在目录下执行：1gdb a.exe 调试实例及部分简单调试命令test.c:1234567891011121314151617181920#include &lt;stdio.h&gt;int func(int n) &#123; int sum=0,i; for(i=1; i&lt;=n; i++) &#123; sum+=i; &#125; return sum;&#125;int main() &#123; int i; long result = 0; for(i=1; i&lt;=100; i++) &#123; result += i; &#125; printf(\"result[1-100] = %d \\n\", result ); printf(\"result[1-250] = %d \\n\", func(250) );&#125; 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960(gdb) b 12 //设置断点，break的缩写，在源程序第12行处。Breakpoint 1 at 0x6e6: file test.c, line 12.(gdb) b func //设置断点，在函数func()入口处。Breakpoint 2 at 0x8048456: file tst.c, line 3.(gdb) info b //查看断点信息Num Type Disp Enb Address What1 breakpoint keep y 0x00000000000006e6 in main at test.c:122 breakpoint keep y 0x00000000000006b7 in func at test.c:4(gdb) r //运行程序，run的缩写Starting program:Breakpoint 1, main () at test.c:1313 long result = 0;(gdb) n //next的缩写，执行下一步14 for(i=1; i&lt;=100; i++) &#123;(gdb) n15 result += i;(gdb) n14 for(i=1; i&lt;=100; i++) &#123;(gdb) n15 result += i;(gdb) c //继续运行程序，continue命令简写。Continuing.result[1-100] = 5050 //程序输出。Breakpoint 2, func (n=250) at tst.c:54 int sum=0,i;(gdb) n5 for(i=1; i&lt;=n; i++)(gdb) p i //打印变量i的值，print命令简写。$1 = 134513808(gdb) n6 sum+=i;(gdb) n5 for(i=1; i&lt;=n; i++)(gdb) p sum$2 = 1(gdb) n6 sum+=i;(gdb) p i$3 = 2(gdb) n5 for(i=1; i&lt;=n; i++)(gdb) p sum$4 = 3(gdb) bt //查看函数堆栈。#0 func (n=250) at tst.c:5#1 0x080484e4 in main () at tst.c:24#2 0x400409ed in __libc_start_main () from /lib/libc.so.6(gdb) finish //退出函数。Run till exit from #0 func (n=250) at tst.c:50x080484e4 in main () at tst.c:2424 printf(\"result[1-250] = %d /n\", func(250) );Value returned is $6 = 31375(gdb) c //继续运行。Continuing.result[1-250] = 31375 //程序输出。Program exited with code 027. //程序退出，调试结束。(gdb) q //退出gdb。 step（简写为s）命令和next命令都是执行下一步，不同的是step命令会进入函数的内部，而next命令则是会直接执行完函数，然后在该函数的下一步等待如在上面代码的17行加上func(30)并进行gdb调试；1234Breakpoint 1, main () at test.c:1717 func(30);(gdb) n18 printf(\"result[1-100] = %d \\n\", result ); 使用next命令直接跳到18行等待12345678910Breakpoint 1, main () at test.c:1717 func(30);(gdb) sfunc (n=30) at test.c:44 int sum=0,i;(gdb) s5 for(i=1; i&lt;=n; i++) &#123;(gdb) s6 sum+=i;(gdb) s 可以看到，使用s进入到了func函数的内部","tags":[{"name":"调试技术","slug":"调试技术","permalink":"http://yoursite.com/tags/调试技术/"}]},{"title":"指令集","date":"2017-03-13T15:01:26.000Z","path":"2017/03/13/instruction/","text":"Concept: 指令集是CPU可以执行的指令的集合，是计算机设计者和计算机程序员之间的接口，CPU的操作由其可以执行的指令集决定。 Elements of an Instruction Operation code(Opcode) 操作码 表示该指令进行的操作的类型 Source Operand Reference 源操作数 该操作所需输入的操作数 Result Operand Reference 目标操作数 操作产生的需要存储的结果 Next Instruction Reference 下一条指令地址 告诉CPU当前指令完成后下一条指令的地址 Instruction Representation 机器码：指令(无论操作数还是操作码)都是无差别地以二进制的形式存储 汇编语言：操作码用缩写的形式(助记符)表示，说明该指令进行的操作的类型，操作数也以相应的符号来表示 Instruction Types Data processing(数据处理) Data Storage(数据存储) Data movement(I/O) Control(控制) Instruction Set Design Operation repertoire(操作类型储备) How many ops? What can they do? How complex are they? Data types(数据类型) Insturctoin formats(指令格式) Length of opcode field Number of addresses Registers Number of CPU registers availiable Which operations can be performed on which registers? Addressing modes(寻址模式) Types of Operand Addresses Numbers Charcters Logical Data Types of Operation Data Transfer(数据传输) Arithmetic(算术运算) Logical(逻辑运算) Conversion(转换):转换数据的形式，如十进制转为二进制 I/O System Control Transfer of Control(控制转换)：例如跳转，子程序调用 Byte Order(位元组顺序) little-endian(小端规则):LSB(最低有效位，即最左边的位)存储在低位的地址之中。 big-endian(大端规则):LSB存储在高位的地址之中。 0x12345678存储左边为大端规则，右边为小端规则 Addressing Modes(寻址模式)根据对操作数和/或地址的使用不同加以区分的多种寻址方式中的一种说明如何获取指令中操作数和下一条指令,经常不止一种寻址方式被使用，不同的操作码使用不同的寻址方式，指令中的方式字段说明寻址的方式。 Immediate (立即寻址)：操作数是位于指令自身中的常数 Direct (直接寻址)：指令中存储的是操作数的地址 Indirect (间接寻址)：指令中存储的是操作数的地址的地址 Register (寄存器寻址)：操作数是寄存器 Register Indirect (寄存器间接寻址)：对寄存器访问取得操作数地址 Displacement (Indexed) (偏移寻址)：操作数在内存中，其地址是指令中基址寄存器和常数的和 Stack (堆栈寻址)：详情点击 速度排序：立即寻址 &gt; 寄存器寻址 &gt; 直接寻址 &gt; 寄存器间接寻址 &gt; 间接寻址 RISC vs CISCCISC：复杂指令集，有大量的变长的，复杂结构的指令，可以完成复杂的任务RISC：精简指令集，减少了大量非必须指令且简化了剩余的指令使其执行速度加快。特征如下： 所有指令定长（4个字节），通过补0实现使CPU能够快速解码 指令只能从内存加载到寄存器或从寄存器存储到内存 对于算术运算和逻辑运算，没有直接的方法在寄存器和内存之间直接进行（即算术运算指令和逻辑运算指令无法读取内存中的内容） RISC架构拥有大量的寄存器 RISC只有少量的基本的指令 99%的指令可以在一个时钟周期内执行完 由于RISC指令集的精简，其指令用硬件的方法实现 Control Unit(控制单元)Micro-Operations","tags":[{"name":"计算机组成","slug":"计算机组成","permalink":"http://yoursite.com/tags/计算机组成/"}]},{"title":"进程","date":"2017-03-12T14:10:43.000Z","path":"2017/03/12/进程/","text":"Process Concept简单来说，进程就是指正在执行的程序，执行并不一定是在运行（运行是进程的五状态之一）。一个进程包括以下三个方面 程序计数器 (program counter) 堆栈段 (stack) 数据段 (data section) 程序包括代码段、当前活动（通过PC的值和处理器寄存器的内容来表示）、堆栈段（包括临时数据，如函数参数、返回地址和局部变量）和数据段（包括全局变量），可能还包括堆(heap)，进程在运行期间动态分配的内存。 如下图所示： Process State new(创建): The process is being created running(运行): Instructions are being executed waiting(等待): The process is waiting for some event to occur ready(就绪): The process is waiting to be assigned to a processor terminated(终止): The process has finished execution 进程五状态表： Process Control Block(PCB)每个进程在操作系统内用进程控制块来表示，它包含许多与一个特定进程相关的信息。 Process state: 包括创建、就绪、运行、等待、停止等 Program counter: 表示进程要执行的下个指令的地址 CPU registers: 进程所使用到的寄存器的信息，在中断时需要保存，以便进程以后能正确执行 CPU scheduling information: 进程优先级、调度队列的指针和其他调度参数(进程调度讨论) Memory-management information: 基址寄存器和限址寄存器的值，页表或段表 Accounting information(审计信息): CPU时间、实际使用时间、时间界限、审计数据 I/O status information: 分配给进程的IO设备列表、打开的文件列表等 Process Scheduling为了最大效率地利用CPU，进程调度选择一个可用的进程到CPU上执行。 Process Scheduling Queues(调度队列) Job queue – set of all processes in the system Ready queue – set of all processes residing in main memory, ready and waiting to execute Device queues – set of processes waiting for an I/O device Processes migrate(迁移) among the various queues 注意，并没有执行队列这个说法，单CPU每次只有一个进程在被执行，不存在执行队列 新进程开始处于就绪队列。在就绪队列中等待直到被选中执行或被分派。当进程分配到CPU执行时，可能发生下面几种事件中的一种： 进程可能发出一个IO请求，并被放到IO队列中 进程可能创建一个新的子进程，并等待其结束 进程可能会由于中断而强制释放CPU，并被放回到就绪队列 Scheduler(调度程序)进程在其生命周期中会在各种调度队列之间迁移。为了调度，操作系统必须按某种方式从这些队列中选择进程。进程选择是由相应的调度程序来执行的。 长期调度程序(long-term scheduler)：又叫做作业调度程序(job scheduler)从存放”进程”的大容量存储设备的缓存池中选择进程，并加载进内存准备执行，一般与进程的创建相关。此处，个人的理解是作业调度程序是将作业队列(job queue)中的进程调度到就绪队列中。 短期调度程序(short-term scheduler)：又叫做CPU调度程序，从准备执行的进程(在就绪队列中)中选择进程，并为之分配CPU。 中期调度程序(medium-term scheduler)：核心思想是能将进程从内存中移出，从而降低多道程序设计的程度。之后，进程能被重新调入内存，并从中断处继续执行。这种方案称为交换(swapping) 长期调度程序被调用的频率比较低，短期调度程序被调用的频率比较高 Context Switch(上下文切换)将CPU切换到另一个进程需要保存当前进程的状态（保存在PCB中）并恢复另一个进程的状态，这一任务称为上下文切换 Operations on Processes(进程操作)进程创建(Process Creation)进程在其执行过程中，能通过创建进程系统调用创建多个新进程。创建进程称为父进程，而新进程称为子进程。每个新进程可以在创建其他进程，从而形成了进程树。 创建进程的两种可能： 父进程与子进程并发(concurrently)执行 父进程等待，直到某个或全部子进程执行完 新进程的地址空间的两种可能： 子进程是父进程的复制品（具有和父进程相同的程序和数据） 子进程装入另一个新程序 资源共享： 父进程和子进程共享所有资源 父进程分配一部分资源给子进程 父进程和子进程没有共享资源 进程终止(Process Termination)当进程完成执行最后的语句并使用系统调用exit()请求操作系统删除自身时，进程终止。这是，进程可以返回状态值到父进程。所有进程资源被操作系统释放。父进程终止子进程的原因： 子进程使用了超过它被分配的一些资源 分配给子进程的任务已不再需要 父进程退出，如果父进程退出，操作系统不允许子进程继续，这称为级联终止(cascading termination) Interprocess Communication(进程间通信IPC)独立进程：一个进程不能影响其他进程或被其他进程所影响 协作进程：系统中一个进程能影响其他进程或被其他进程所影响 优点： 信息共享 提高运算速度 模块化 方便 Cooperating Processes(协作进程)生产者-消费者问题是协作进程的通用范例。生产者进程产生信息以供消费者进程消费。为了允许生产者进程和消费者进程能并发执行，必须要有一个缓冲来被生产者填充并被消费者所使用。此缓冲驻留在生产者进程和消费者进程的共享内存区域内，当消费者使用一项时，生产者能产生另一项。生产者和消费者必须同步，以免消费者消费一个没有生产出来的项。 缓冲主要存在两种： 无限缓冲(unbounded-buffer)：对缓冲大小没有限制。消费者可能不得不等待新的项，但生产者总是可以产生新项 有限缓冲(bounded-buffer)：缓冲固定，若缓冲为空，消费者必须等待；若缓冲为满，生产者必须等待 通信模型 左图表示消息传递模型；右图表示共享内存模型。 共享内存系统生产者-消费者问题，通过缓冲来实现。 消息传递系统消息传递是由操作系统提供机制，让协作进程能通过消息传递工具来进行通信。消息传递工具提供至少两种操作：发送和接受。send(),receive()操作方法： 直接或间接通信 同步或异步通信 自动或显式缓冲 直接或间接通信对于直接通信，需要通信的每个进程明确地命名通信的接受者或发送者。 直接通信的通信线路具有如下特点： 在需要通信的每对进程之间自动建立线路。进程只需要知道相互通信的标识符。 一个线路只与两个进程相关。 每对进程之间只有一个线路。 这种方案展示了对称寻址，即发送和接受进程必须命名对方以便通信。另外有非对称寻址，即只要发送者命名接受者，而接受者不需要命名发送者。也就是单向和双向的区别。 间接通信：通过邮箱或端口来发送和接受信息。邮箱可以抽象成一个对象，进程可以向其中存放消息，也可以从中删除消息，每个邮箱都有一个唯一的标识符。间接通信的通信线路具有如下属性： 只有在两个进程共享一个邮箱时，才能建立通信线路。 一个线路可以与两个或更多的进程相关联 两个通信进程之间可有多个不同的线路，每个线路对应于一个邮箱 同步和异步通信消息传递可以是阻塞(block)或非阻塞 —— 也称为同步或异步 阻塞send：发送进程阻塞，直到消息被接收或被邮箱所接收 非阻塞send：发送进程发送消息并继续操作 阻塞receive：接受者阻塞，直到有消息可用 非阻塞receive：接受者收到一个有效消息或空消息 自动或显式缓冲不管通信是直接的或是间接的，通信进程所交换的消息都驻留在临时队列中。 零容量：线路中不能有任何消息处于等待，必须阻塞发送，直到接收者接收到信息。 有限容量：队列长度为有限的n，最多只能有n个消息驻留其中，若未满，可以接收新消息，且发送者可继续执行不必等待。若容量已满，必须阻塞发送直到队列中的空间可用为止。 无限容量：队列长度无线，从不阻塞发送者 零容量情况称为没有缓冲的消息系统，其他情况称为自动缓冲。 共享内存和消息传递两种方式对比消息传递对于交换较少数量的数据很有用，因为不需要避免冲突。对于计算机间的通信，消息传递也比共享内存更易于实现。共享内存允许以最快的速度进行方便的通信，在计算机中可以达到内存的速度。共享内存比消息传递快，消息传递系统通常用系统调用来实现，因此需要更多的内核介入时间消耗。与此相反，在共享内存系统中，仅在建立共享内存区域时需要系统调用，一旦建立了共享内存，所有的访问都被处理为常规的内存访问，不需要来自内核的帮助。","tags":[{"name":"操作系统","slug":"操作系统","permalink":"http://yoursite.com/tags/操作系统/"}]},{"title":"随写","date":"2017-03-11T14:32:03.000Z","path":"2017/03/11/2017年03月11日22-31-58/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX1/FMxpdS6eCIIHVqtDtnIqjTWkwimQN0HUIcfT0/81bbgaCINHzPHQTNrN0CDe7cTq0I9tIu+wO7KYBC8K8Zo+PpK6lE59R3++P8qYxxvCnnN1mLN6B6w7AeLjdusX2JplAkhuLv0a1HUluzclCfNKyQHusYp5HugktxyQfHjeJ2SMJtvPYuABUh0pUb6dRLtVPoRYhJRrnDb4DXmBltuqJZJcUeqhcmxCKbcUC0ixtsqZa+Wouzp0bR8zcxK4EfAKY9wPvJF/VNstqlA2lEnyWAYQwkFf8I2MYPIA5pGFcKmJfDDB9e5pOBMBRdDZF1xEj0oPSUAMTkurTb58higST1P0q8SwMQOw5jTu7B5n1/dOEBC2Bze+u4EvNAYr/OuFREhBmzpiYRbnSons9RhjXBxttrggVC5RxqQTv9dXwFB38tw8Nm2ekXj6ZG01BfuG6WBy2kf2+W0893M2OtiDzls04gzfIqs7+7QGKe01T3LPM2fe4S4Ko7NvgymoCmJKqzZ+T7PGD3TdKWbHgUGgyyWlr0HnbaNWOwAjuv8utwG5dL0m19o/t/LvtlwLH2UXb53Ij9UegGZF2EmUP0CAiXAYyzEwQU9Aw/rnU1gotaYFv5AqMkPqfmgqc4NxLUJ5Sg6KeOIxYjyTYLdiykVFsS6VolzkpaX1NilN+wtGojjzok8lmef8XhfSJO00AU7U81u+822A7Z4v1szFdBI/BE9BQBqRZvCxBPoF3kZqZiGhItDZli+eqOu2MXYvUOuUbdRI/9FvdIIo3xb9AI4S1g3fWKQa40fBZBINZt3rigg1gNF9rAfs++OdOWg/DVrtn9em3eP6Oo9F3Z/uYe61xA1FjQA1gl2j9wM2iuTjT76jsjiBw/LZS8AYM4nr0btfVaGLGMCx2TKuCkC0wA2+ioBjJhoYCn+PfI2QebuP3KcrZwTBiDLAE/F+6FmVkAuFjtKrTLZdUrhKTAWRT2dRx/tNOzG5moA+yEM3ZJylFlfmE6Z5cRqPX8YEEYHQ3geHIH3lX21ZUttSNVhxtPn9ZCShURZyQxBjNIGx4rwTUoCHCSgSbgfj3nLEutUElvEZCZ9LqKFbRPHNqU9W8YyXO2lQ8tpYq4Aj8nXnB4oBs5GyiGEnlxGcCMJg54X1x2ckbuuOolCkgyf05qkr0XhUzxBCe+bhUl6BFMmuz71jh7CnPv6QApXBGspf1uyOHitVi4m80OvT1f+lXmO/EDkB4R0nZO/vrCwgjtDbDYrTt/1LMnO9cLU4wiWOMMlOzA/JtiAEyUROc0XmNPjoRjEwr/aePO0XmvxIsWqQnY5Vzv06VSOulWUCVttVqNDzqar9HfxJ3Mg+VpJN6BB0Z9IeU6TaRvHN25RXbxPWB72hADlxdisyl/BrmK1NBAnf01iyrlSBpwrT0pCsucjFQa4VTl4Ngdrbrei79cr4cmRuoIPoE3n12wWTop7VLcilLaroc0Q3bWktxL60fVKMuqUto/FHM0cw7RUPlv8IiBfHMKhDM+HfGsAOrLd0DmaTNFXQEOChP75dqD0wvvi0qf5oYvmMTJFhr0l4kcuZcxb4U2KhWYjV5qd9Bf60HOk9NlDAjMDBwmRKwrf42gqqFttESa7lxugJ/PXhZf0drISFLzhOQiAD0p2qH/Tc+7S0CKVoIl23k1ABj8JvYLSnJwqVnySCOmyK7DvQuuuvibUEaYOGRslfj7xa+2ZQ/bVH5/Mf173k7tERPEawpzUVg3tWQl1SnWae+5MwN4Sfadzrcp+t9pCEULbaVqE2G9bjiotAAnmiFgVWJjrxOQ80nVaEVk3HXAxCOh9O/PgWxlNtZnM46AA7qwgCUs4Fvv/IZRE7RmvBWGE3iwu7kjYxHf9AtxavK9gUxvbG3tqOJLAA5F4PYc+XSydCL","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"C++ Function","date":"2017-03-11T07:34:55.000Z","path":"2017/03/11/function/","text":"函数定义：一个典型的函数定义包括以下部分：返回类型(return type)、函数名、由形参(parameter)组成的列表、函数体(function body)。 函数声明：和其他名字一样，函数的名字也必须在使用之前声明。类似于变量，函数只能定义一次，但可以声明多次。如果一个函数永远不会被用到，允许只有声明，没有定义。函数的声明和函数的定义很类似，唯一的区别是函数声明无需函数体。由于不包含函数体，形参的名字也可以不用。 参数传递：传引用和传值：形参的类型决定了形参和实参交互的方式。如果形参是引用类型，它将被绑定到对应的实参上面，否则，将实参的值拷贝后赋值给形参。 1、使用引用传递避免拷贝，如果无须改变形参的值，最好声明为常量引用2、使用引用形参返回额外信息 const形参和实参顶层const作用于对象本身，和其他初始化过程一样，当用实参初始化形参时会忽略掉顶层const。所以：1void fcn(const int i) 调用时，因为顶层const被忽略，所以可以传入常量和非常量，同时，因为忽略顶层const的问题：12void fcn(const int i) &#123;&#125;void fcn(int i) &#123;&#125; 虽然C++支持函数重载，但是由于忽略了顶层const的关系，这样属于重复定义了该函数。 数组形参1、普通数组形参因为数组不允许被拷贝以及使用数组时通常会将其转化为指针。因此当我们向函数传递一个数组时，实际上传递的是指向数组首元素的指针。1234//虽然形式不同，但是这三个print函数是等价的，每个函数都有一个const int*类型的形参void print(const int*);void print(const int[]);void print(const int[10]); //此处的10表示我们期望数组含有多少元素，实际不一定 如果这样定义三个函数，编译器会报错，因为重复定义了。 2、数组引用形参C++允许将变量定义成数组的引用，基于此，形参也可以是数组的引用。此时，引用形参绑定到对应的实参上，用法如下:12void print(int (&amp;arr)[10]); //&amp;arr两端的括号必不可少，表示arr是具有10个整数的整型数组的引用void print(int &amp;arr[10]); //错误：将arr声明成了引用的数组 3、传递多维数组和其他数组一样，当将多维数组传递给函数时，真正传递的是指向数组首元素的指针。又因为并不存在多维数组，多维数组只是数组的数组，所以多维数组的首元素本身就是一个数组，指针就是一个指向数组的指针。数组第二维的大小都是数组类型的一部分，所以不能忽略：12void print(int (*matrix)[10], int rowSize) &#123;&#125; //(*matrix)两端的括号必不可少void print(int matrix[][10], int rowSize) &#123;&#125; //与上面的定义等价 默认实参1double get_area(int a = 10, int b = 10); 如上面的代码中，每个形参都提供了一个默认实参，一旦某个形参被赋予了默认值，它后面的所有形参都必须有默认值。因为get_area函数为它的所有形参都提供了默认实参，所以我们可以用0、1、2个实参来调用该函数：123area = get_area();area = get_area(1); //等价于get_area(1, 10)area = get_area(11, 11); //等价于get_area(11, 11)； 函数调用时实参按其位置解析，默认实参负责填补函数调用缺少的尾部实参(靠右侧位置)，所以只能省略尾部的实参。 函数的返回值1、没有返回值的函数没有返回值的函数只能存在于返回类型是void的函数中。返回void的函数不要求非得有return语句，因为在这类函数的最后一句后面会隐式地执行return。 2、有返回值的函数返回类型不是void的函数内的每一条return语句必须返回一个与分会类型相同类型的，或者是能隐式地转换成函数的返回类型的值。 3、值的返回的方式返回一个值的方式和初始化一个变量或形参的方式完全一样：返回的值用于初始化调用点的一个临时量，该临时量就是函数调用的结果。注意：不要返回局部对象的引用或者指针 4、引用返回左值函数的返回类型决定函数调用是否是左值。调用一个返回引用的函数得到左值，其他返回类型得到右值。可以像使用其他左值那样来使用返回引用的函数的调用，特别是，我们能为返回类型是非常量引用的函数的结果赋值。 5、返回数组指针同样，因为数组不能被拷贝，所以函数不能返回数组。不过，函数可以返回数组的指针或引用，但是由于返回数组的指针或引用的写法太过复杂，推荐使用尾置返回类型。（之后另开博客介绍） 函数重载1、重载函数的定义如果同一作用域内的几个函数名字相同但形参列表不同，我们称之为函数重载(overload)。这些函数接受的形参类型不一样，但是执行的操作类似。当调用这些函数时，编译器会根据传递的实参类型推断想要的是哪个函数。对于重载的函数，它们应该在形参数量或形参类型上有所不同。1、不允许两个函数出了返回类型外其他所有的要素都相同，若如此，则第二个函数的声明是错误的。2、虽然两个形参列表看起来不一样，但其实是一样的，如下：12int lookup(const int&amp; a);int lookup(const int&amp;); //虽然一个形参有名字，一个没有，但其实一样 123typedef Phone Telnoint lookup(const Phone&amp;);int lookup(const Telno&amp;); //Telno和Phone类型相同 12int lookup(int);int lookup(const int); 拥有顶层const的形参无法和另一个没有顶层const的形参区分开来12int lookup(int&amp;);int lookup(const int&amp;); 底层const可以被区分 2、重载函数的调用编译器首先将调用的实参与重载集合中每一个函数的形参进行比较，然后根据比较结果决定调用哪个函数，这个过程叫做函数匹配(function matching)或重载确定(overload resolution)，下面会着重介绍。调用重载函数的三种结果：1、编译器找到一个与实参最佳匹配(best match)的函数，并生成调用该函数的代码。2、找不到任何一个函数与调用的实参匹配，此时编译器发出无匹配(no match)的错误信息。3、有多于一个函数可以匹配，但是每一个都不是明显的最佳选择。此时也将发生错误，称为二义性调用(ambiguous call)。 内联函数将函数指定为内联函数(inline)，通常就是将它在每个调用点上“内联地”展开。1234incline const string &amp;shorterString(const string &amp;s1, const string &amp;s2) &#123; return s1.size() &lt;= s2.size() ? s1: s2;&#125; 该内联函数在调用的时候：1cout &lt;&lt; shorterString(s1, s2) &lt;&lt; endl; 将在编译过程中展开成类似于下面的形式：1cout &lt;&lt; s1.size() &lt;= s2.size() ? s1: s2 &lt;&lt; endl; 一般来说，内联机制用于优化规模较小、流程直接、频繁调用的函数。 函数匹配1、选定本次调用对应的重载函数集，集合中的函数称为候选函数(candidate function)。候选函数有两个特征：一是与被调用的函数同名，二是其声明在调用点可见。2、考察本次调用提供的实参，然后从候选函数中选出能被这组实参调用的函数，这些新选出的函数称为可行函数(viable function)。可行函数也有两个特征：一是其形参数量与本次调用提供的实参数量相等，二是每个实参的类型与对应的形参类型相同，或者能转换成形参的类型。3、寻找最佳匹配（如果存在的话），从可行函数中选择与本次调用最匹配的函数。原则是实参类型与形参类型越接近，匹配的越好。含有多个形参的函数匹配情况比较复杂，如果出现： 该函数每个实参的匹配都不劣于其他可行函数需要的匹配。 至少有一个实参的匹配优于其他可行函数提供的匹配。 如果在检查了所有实参之后没有一个函数“脱颖而出”，则该调用是二义性调用。 实参类型转换优先级1、精确匹配，包括以下情况： 实参类型和形参类型相同 实参从数组类型或函数类型转换成相应的指针类型 向实参添加顶层const或者从实参中删除顶层const 2、通过const转换实现的匹配3、通过类型提升实现的匹配4、通过算术类型转换或指针转换实现的匹配5、通过类类型转换实现的匹配 函数指针函数指针声明和定义函数指针指向的是函数而非对象。和其他指针一样，函数指针指向某种特定类型。函数的类型由它的返回类型和形参类型共同决定，与函数名无关。1bool lengthCompare(const string &amp;, const string &amp;); 该函数的类型是bool(const string &amp;, const string &amp;)。要想声明一个可以指向该函数的指针，只需要用指针替换函数名即可：1bool (*pf)(const string &amp;, const string &amp;); //*pf必须要加括号，否则表示名为pf，返回值为bool*的函数 函数指针的使用当我们将函数名作为一个值使用时，该函数自动地转换成指针。12pf = lengthCompare; //pf指向名为lengthCompare的函数pf = &amp;lengthCompare; //等价的赋值语句，取地址符是可选的 此外，我们还能直接使用指向函数的指针调用该函数，无须提前解引用指针。在指向不同函数类型的指针间不存在转换规则，必须精确匹配 函数指针形参和数组类似，虽然不能定义函数类型的形参，但是形参可以是指向函数的指针。此时，形参看起来是函数类型，实际上确实当成指针使用：1234void useBigger(const string &amp;s1, const string &amp;s2, bool pf(const string &amp;, const string &amp;)); //第三个参数会自动转换成指向函数的指针void useBigger(const string &amp;s1, const string &amp;s2, bool (*pf)(const string &amp;， const string &amp;));//等价声明","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"随写","date":"2017-03-10T15:28:23.000Z","path":"2017/03/10/2017年03月10日23-27-37/","text":"Welcome to my blog, enter password to read. Decrypt U2FsdGVkX1/BK4fTatPkkH+JWTv80rabtl55/4WOYMmoFfcNr/w8KqXfNiFZVYTH8NtKTKCYuY4/Is8mowK9b2411WKW++3z+EY2wC2wPZMiW1C0MIokBU6xAlxwULbYOjEKek9l0wceuRxoG5tgz9wQOVbme6L6alwVUeVFZE3N5P9+BMx1LZlrMZG78OEigZhT6sL5bb2bMI3OvXj5VBIKhnZ+Ndm8dT4UGhcaYtZAho21tfDGg8Z82aysVcuaj+KAb6T8uZxwU+cbfkBEpgl4NTkrQG51z2nrZrFjzQsBRHgHvoCIXVxoPBAurbsOgDlG0ZluCCTuWRKgqiHm8ioGMwJrGwXaTqsD7NUEzW8vyCdkbv5WXqwBeHSqiIGiUQbCwcQ+sAXo8NpxFakQBHWd261nAW25ebDfO+JHNdKTdU6b30YlIeADzlppWhW1sH5l/FNtvlWxYoONNsVA96bIi9JDXeM42Z6ZlDzBr9zp/OZJFe03uYbkNAynpSv3I+J1J1FInC0MghNrg5WO2GmV0eFz0K+Xv+Dbb41waAt5qJaNl4gN3bvmmK5UTm7wDDsSiKDxhiqPSmsH1IBimakkfLhaXYHl2mV4DrapUDdSmpon0IyLTrZLqt+S+R3be/YmFAtTiIyjse1gTIJbJNtgCVbM599kd1DWupCbGD3G47eauN8iwnqnvFobJhVVH2xSaGo1DF7eornPoojBbFc4yFZyjxflSK01aAp6YQWYayzCJ4ywI91FBiRPrmEchQURlvVgE7FORxqzzBGxiBBreSHKvVoOA8FOd/aEuUXiKdk8qiMhnntwvP/v8Jg3m0bpeNl4l2WXhkTdNU54cY+CyOLkJhRMwOg7ku3cripX1S1iyd2R1VWSYzZiD2z0clS+Ii2q3jMMhEqYmQxRFD9tPSAlfhf9mF8oSG474BL6pHKGEaz7ufY6ZezYNvw4q3COTjd9ZCHPu4ZojpZPK9w78IKmh6JEubZNbmmq8/HKk525csfqxzB48WX1bUS+5TELWjyUZdEa/i6TCU4zer+iA1Pn9W9Kfj2NkMD8yhtfUX//Rz6tzKjH3SI04BQkUHnOMC67fSbQaVxmAxHwMMqau1ZIf7PijnHEtdeWRQiY2aCLSMvYCDaGYVTOpJKSqc2nhZiHCCnr4UCG2cWSQYNfFnIQ5omamUlQXa0BfH1ez4bN/0H9r6C9TzHPNFxacmMwrkMq6NFP09qD6K/nW4bHBx8g9jZSe+W+1K8aaG1lqNzUGpPPKQfHxiVNiuUwV3smPDxQzPnXRXTPTqjJAdKp3tDSDwBqF19J+x/DJmATXg3PFMs2C1weTnFsONdTjuT169qRNCG3D59/kk9FDdMYV7deuk9WxkBbY7PbZeq5ojx/lEz/ZX77CN1INEEYhCBY2WLukpH/NY52weJUzGt6Gy/E6CSBLSbTofwf49Rtd7g0D2j2atlodK6IUMm7iFBnzcTDYc0iK+FK5142zJrIrmPTB8KEAyW1KRT4336HSI8rOmMJYDMr0EaVUyDaUcNnyWALaoyWtexdvZh1RV6WI9S2Gv6k0f5z4JBnoHuiflBK5n11LrpaLa2YRtGHszZ/7zklUPEbI4IiF3puP/hRts66vktMcTs47kXUMmMJQKY4T3LXQQ1DzpeSpY4mCRdX1s8WPwsKxbN5hdYoNYOXp7xd1pjB5tHpZOHdWIHmtvhJMUFsKFLZc4b0CNxu7sRNTHDi86ptMVPahAMruOiN2MbXNn5ZF1oWl/eqtUXjiYm/SOFI4rQmwMwSrFctv4gTzm47hyT28ML0d+4/+ffXqIctzNBf4hUzrk1Tbk5suZDiBMbP+2YJ5V/uc3IA9vHhlHBg2IsyhSlJYvAuRJNFRrD3tkbn9+p1ucVXQlFe2g171Sj7zyn0rolyYDr1UvRY1giMr/n9x8TypSoW36LNytvaq7qKQYTHrU2b/gr8tvoJy0vvDcKb0QPSyNqDSk7O+GSekP2t34G1be/1SsrYCqraHkvb6ZotFX8Wp8spisePWbRzXOhj3xNhVME/i4PfFsGEWzU2LTf1+CC3hJgIY6VmTIz5aLYvwEdtyikBOMUVyA/KNne6xNz12LdBoLRTlzDeJ28zAlfAcU8eG5pR3wfht/Ay+QmTbdLYM9FZBjU+lLiVE0bBIvOt8p24pmjgWoIUBICCvP5bSYZdrs5cC7aEB9PHNraTnQWkmB83mui0bo5gWAuZfrSKIv8kz+fj81HcbcL8mnRqYM5JNCyoe/pQNrCLoFNyHhsRoWZJoTWkKW8m5H3WIBQYbMJyL30+PkM56+KF46w48perYGctPm6JzpsiM/H4A5cmlVLa16wnz+JzfewwCcBGaea19OQv9sqoJ/PRZdAzjpc4drrt7xWXrcTcNFnTZ7lUebjxC1POHSgNhiOoPvPqJb1u6KWcSi1EdXUr21PlhtzIVdZZxvpTLHEy63inmehSQcuDS362jcfIOIlUcUerf1Gg9oTMt4Y+7bnItH/2jsvGxM2WlKsFKlc0orrnrt5wp8Bg+OxnVa+uVMXaeYAmKKkmrQPItAO9lLiWqT8dkIUDI1dLVNK9aI0ihngh6XnneMwqn+JN5Rux18TRneE3njoW8NUzBuqvpjaoT34nNETXCGuOizXpqEJ8kN0CIxhsUYeiIPBnpZpTXgxXEmNL9E8DeV+tLdsnbuVVYSSh6Q89lFU6TGCDh1uEaMOltzuKi+u9wvyFYP29xZOcof7LQV+mAWAkdshdtGDkunZG8ZPtk0r8jys/3OsQtvqt1k7SnQPV48A11FipNR6xY57il1GD3UuGHzUC9RvmWj83CrkzoLujIfJ24lxS0BsHUHjjMmdQstFImBp/DI0SMrXjzfGNaN0fSpOVoX0JITrdEzQSAi5i2FpL9f2Zc7oa/FlX8FE=","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/生活/"}]},{"title":"C++中const的用法","date":"2017-03-10T04:30:45.000Z","path":"2017/03/10/const/","text":"const变量const又叫做const限定符，用关键字const对变量的类型加以限定，可以使得变量的值不能被改变。 123const int i = 1; //正确：编译时初始化const int i = get_size(); //正确：运行时初始化const int k; //错误：k是一个未经初始化的常量 没有初始化的常量变量编译错误其实很好理解，因为经过const限定之后变量的值已经无法改变，如果没有初始化那么这个变量的值不确定，且之后其值不能被改变。 const引用const引用称为对常量的引用，简称为“常量引用”,顾名思义，就是这个对象是一个引用，而且这个对象经过const限定符作用之后，对象的值不能被改变。12345678int main() &#123; const int c1 = 10; const int &amp;r1 = c1; int c2 = 4; const int &amp;r2 = c2; c2 = 5; cout &lt;&lt; r2 &lt;&lt; endl;&#125; 如上所示，常量引用r1,r2是一个常量，而同时，因为const的限制，r1和r2的值不能改变，所以通过r1和r2修改c1和c2的值也就不可能，但是c2因为没有const的限制，可以通过c2修改自身的值。 引用的类型必须与其引用对象的类型一致，但存在例外。一种则是允许常量引用绑定一个非常量的对象，但是不能通过该常量引用改变绑定对象的值，此种情况上面已经出现，不在赘述。另一种是在初始化常量引用时允许用任意表达式作为初始值，只要该表达式的结果能转化为引用的类型即可。12double dval = 3.14;const int &amp;ri = dval; 上述代码是合法的操作c机制是12const int temp = dval;const int &amp;ri = temp; 也就是先将dval转化为整型，注意，其中的temp是临时量，所谓临时量对象就是当编译器需要一个空间来暂存表达式的求值结果临时创建的一个未命名的对象。而如果ri不是常量，即：12double dval = 3.14;int &amp;r1 = dval; 此时编译器会报错，错误如下：12error: invalid initialization of non-const reference of type ‘int&amp;’ from an rvalue of type ‘int’int &amp;r1 = dval; 指针和const与引用一样，也可以令指针指向常量或非常量，类似于常量引用，指向常量的指针（不是常量指针）不能用于改变其所指对象的值。要想存放常量对象的地址，只能使用指向常量的指针：1234const double pi = 3.14;double *ptr = &amp;pi; //错误：ptr是一个普通指针const double *cptr = &amp;pi; //正确：cptr可以指向一个常量*cptr = 42; //错误：不能给*cptr赋值 同样，指针的类型必须与其所指对象的类型一致，但是与引用一样，存在例外，允许一个指向常量的指针指向一个非常量的对象：12double dval = 3.14;const double *cptr = &amp;dval; //不能通过cptr改变dval的值 指针是对象而引用不是，所以允许把指针本身定为常量。常量指针必须初始化，一旦初始化完成，则指针的值不能被修改。1234int errNumb = 0;int *const curErr = &amp;errNumb;const double pi = 3.14;const double *const pip = &amp;pi; 将号放在const关键字之前用以说明指针是一个常量，不变的是指针本身的值而非指向的那个值。从右向左阅读解析，如上面代码第二行中，离curErr最近的符号是const，意味着curErr本身是一个常量对象，对象的类型由声明符的其余部分确定。声明符中的下一个符号是，意思是curErr是一个常量指针。最后，声明语句的基本数据类型部分确定了常量指针指向的是一个int对象。同理，我们可以看出pip是一个常量指针，指向的对象是一个双精度浮点型常量。 指向常量的指针和常量指针的对比指向常量的指针是指指针指向的值是一个常量（存在上述的例外），这就说明指针的值是可以被改变的，而常量指针是指指针本身是一个常量，但是指针指向的值不一定是常量。 顶层const指针本身是不是常量以及指针所指的是不是一个常量是两个相互独立的问题。用名词顶层const(top-level const)表示指针本身是个常量，而用名词底层const(low-level const)表示指针所指的对象是一个常量。更一般的，顶层const可以表示任意的对象是常量，这一点对任何数据类型都适用；底层const则与指针和引用等复合类型的基本类型部分有关。123456int i = 0;int *const pl = &amp;i; //顶层const int ci = 42; //顶层const int *p2 = &amp;ci; //底层const int *const p3 = p2; //左边是底层，右边是顶层const int &amp;r = ci; //用于声明引用的const都是底层const 常量表达式常量表达式是指值不会改变并且在编译过程就能得到计算结果的表达式。一个对象（或表达式）是不是常量表达式由它的数据类型和初始值共同决定，例如：1234const int max_files = 20; //是常量表达式const int limit = max_files + 1; //是常量表达式int staff_size = 27; //不是常量表达式，因为只是int类型const int sz = get_size(); //不是，sz的值要到运行时确定","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]},{"title":"C和C++中声明和定义的区别","date":"2017-03-09T16:07:31.000Z","path":"2017/03/10/test-1/","text":"声明使得名字为程序所知，而定义负责创建与名字关联的实体。变量声明规定了变量的类型和名字，在这一点上定义与声明相同，然而定义还申请了存储空间，也可能会为变量赋一个初始值。 如果想声明一个变量而非定义它，就在变量名前添加关键字extern，而且不要显式地初始化变量123extern int i； //声明i而不是定义iint j; //声明并且定义了j 任何包含了显式初始化的声明即成为定义。 在函数体内部，如果试图初始化一个由extern关键字标记的变量，将引发错误。1234567#include &lt;iostream&gt;using namespace std;int main() &#123; extern int i = 3;&#125; 123error: ‘i’ has both ‘extern’ and initializerextern int i = 3; ^ 如果要在多个文件中使用同一个变量，就必须将声明和定义分离。此时，变量的定义必须出现在且只能出现在一个文件中，而其他用到变量的文件必须对其进行声明，却绝对不能重复定义。 正确的用法如下： test.hpp12345#include &lt;iostream&gt;using namespace std;int i = 2; test.cpp12345678910111213#include &lt;iostream&gt;#include \"test.hpp\"using namespace std;extern int i;int main() &#123; cout &lt;&lt; i; i = 1; cout &lt;&lt; endl &lt;&lt; i; return 0;&#125;","tags":[{"name":"C++","slug":"C","permalink":"http://yoursite.com/tags/C/"}]}]